[
  {
    "youtiniTitle": "A New Dawn",
    "foundTitle": "A New Dawn: Star Wars",
    "description": "A long time ago in a galaxy far, far away. . . . “The war is over. The Separatists have been defeated, and the Jedi rebellion has been foiled. We stand on the threshold of a new beginning.”—Emperor Palpatine For a thousand generations, the Jedi Knights brought peace and order to the Galactic Republic, aided by their connection to the mystical energy field known as the Force. But they were betrayed—and the entire galaxy has paid the price. It is the Age of the Empire. Now Emperor Palpatine, once Chancellor of the Republic and secretly a Sith follower of the dark side of the Force, has brought his own peace and order to the galaxy. Peace through brutal repression, and order through increasing control of his subjects’ lives. But even as the Emperor tightens his iron grip, others have begun to question his means and motives. And still others, whose lives were destroyed by Palpatine’s machinations, lay scattered about the galaxy like unexploded bombs, waiting to go off. . . . The first Star Wars novel created in collaboration with the Lucasfilm Story Group, Star Wars: A New Dawn is set during the legendary “Dark Times” between Episodes III and IV and tells the story of how two of the lead characters from the animated series Star Wars Rebels first came to cross paths. Featuring a foreword by Dave Filoni. Praise for A New Dawn “A New Dawn is a fine start to the new Expanded Universe. [John Jackson] Miller steps confidently into the unexplored territory and owns it; he’s crafted a story with pacing and dialogue that feels like classic Star Wars.”—Nerdist “An entertaining adventure . . . with a cast of heroes that mixes laughter with intriguing depths of character. . . . John Jackson Miller packs in plenty of action and surprises.”—Roqoo Depot “A confidently told story that gives fans a lot of reason to be hopeful about what’s to come as we move into this new phase of Star Wars . . . The book certainly got me even more excited for Rebels and to see more of Kanan and Hera’s adventures. We’re also introduced to other characters I would love to see again at some point, whether on Rebels, in another book or, who knows, in live-action at some point.”—IGN “A New Dawn delivers a classic Star Wars experience that fans of all ages will be able to enjoy. It is extremely well-written, with an incredibly diverse cast too. Miller’s prose can easily suck readers in, and leave them speechless when 100 pages have flown by in the blink of an eye.”—Far Far Away Radio “A New Dawn brings us into this new dawn of storytelling with energy, excitement, and characters that have become instantly ensconced into the Star Wars vernacular, and the results will satisfy Star Wars fans of many different palates.”—Coffee with Kenobi “A New Dawn is a well-written novel full of intrigue and twists and turns that does an excellent job of letting Star Wars fans get to know Kanan and Hera.”—Tosche Station “A New Dawn finds an era never before written about in the Star Wars universe—the years prior to the original movie, Episode IV—in robust good health. The narrative takes place on two worlds and a handful of ships in between them, but as with the best of all Star Wars moments, hints at hidden depths beyond.”—Mashable"
  },
  {
    "youtiniTitle": "A New Hope: The Princess, the Scoundrel, and the Farm Boy",
    "foundTitle": "Star Wars: A New Hope The Princess, the Scoundrel, and the Farm Boy",
    "description": "The galaxy is at war. Although the Rebel Alliance has won a few battles against the Empire, hope is fading. The Empire is about to finish building the greatest weapon the galaxy has ever seen-the Death Star. The rebels' only chance to defeat it now lies in the unlikely hands of a princess, a scoundrel, and a farm boy. . . . Acclaimed, New York Times bestselling author Alexandra Bracken delivers a captivating retelling of Star Wars: A New Hope like you've never experienced before. Since the premier of the original film, Princess Leia, Han Solo, and Luke Skywalker have become iconic, larger-than-life characters. The Princess, the Scoundrel, and the Farm Boy takes a deeper look at these three heroes as they join forces to defeat the evil that threatens their entire galaxy."
  },
  {
    "youtiniTitle": "Aftermath",
    "foundTitle": "Aftermath: Star Wars",
    "description": "NEW YORK TIMES BESTSELLER • Journey to Star Wars: The Force Awakens “Star Wars: Aftermath [reveals] what happened after the events of 1983’s Return of the Jedi. It turns out, there’s more than just the Empire for the good guys to worry about.”—The Hollywood Reporter As the Empire reels from its critical defeats at the Battle of Endor, the Rebel Alliance—now a fledgling New Republic—presses its advantage by hunting down the enemy’s scattered forces before they can regroup and retaliate. But above the remote planet Akiva, an ominous show of the enemy’s strength is unfolding. Out on a lone reconnaissance mission, pilot Wedge Antilles watches Imperial Star Destroyers gather like birds of prey circling for a kill, but he’s taken captive before he can report back to the New Republic leaders. Meanwhile, on the planet’s surface, former rebel fighter Norra Wexley has returned to her native world—war weary, ready to reunite with her estranged son, and eager to build a new life in some distant place. But when Norra intercepts Wedge Antilles’s urgent distress call, she realizes her time as a freedom fighter is not yet over. What she doesn’t know is just how close the enemy is—or how decisive and dangerous her new mission will be. Determined to preserve the Empire’s power, the surviving Imperial elite are converging on Akiva for a top-secret emergency summit—to consolidate their forces and rally for a counterstrike. But they haven’t reckoned on Norra and her newfound allies—her technical-genius son, a Zabrak bounty hunter, and a reprobate Imperial defector—who are prepared to do whatever they must to end the Empire’s oppressive reign once and for all. Praise for Aftermath “The Force is strong with Star Wars: Aftermath.”—Alternative Nation “The Star Wars universe is fresh and new again, and just as rich and mysterious as it always was.”—Den of Geek “[Chuck] Wendig neatly captures the current states of the Empire and Rebel Alliance and does so through flawed, real, and nuanced characters. His writing gets you up close and personal. . . . Wendig does wonders with dialogue and voice and carving out space for everyone to breathe. Aftermath is a strong foot forward into unexplored territory and puts down just enough foundation that you can start picturing the Resistance and First Order of The Force Awakens taking shape.”—Nerdist “If the opening chapter of the Wendig’s Aftermath trilogy is any indication, the ‘Journey to Star Wars: The Force Awakens’ will be every bit as exciting as the movie.”—New York Daily News “A wonderful Star Wars adventure by a gifted author.”—SF Book Reviews"
  },
  {
    "youtiniTitle": "Aftermath: Empire's End",
    "foundTitle": "Empire's End: Aftermath (Star Wars)",
    "description": "NEW YORK TIMES BESTSELLER • Following Star Wars: Aftermath and Star Wars: Life Debt, Chuck Wendig delivers the exhilarating conclusion to the New York Times bestselling trilogy set in the years between Return of the Jedi and The Force Awakens. EVERY END IS A NEW BEGINNING. As the final showdown between the New Republic and the Empire draws near, all eyes turn to a once-isolated planet: Jakku. The Battle of Endor shattered the Empire, scattering its remaining forces across the galaxy. But the months following the Rebellion’s victory have not been easy. The fledgling New Republic has suffered a devastating attack from the Imperial remnant, forcing the new democracy to escalate its hunt for the hidden enemy. For her role in the deadly ambush, Grand Admiral Rae Sloane is the most wanted Imperial war criminal—and one-time rebel pilot Norra Wexley, back in service at Leia’s urgent request, is leading the hunt. But more than just loyalty to the New Republic drives Norra forward: Her husband was turned into a murderous pawn in Sloane’s assassination plot, and now she wants vengeance as much as justice. Sloane, too, is on a furious quest: pursuing the treacherous Gallius Rax to the barren planet Jakku. As the true mastermind behind the Empire’s devastating attack, Rax has led the Empire to its defining moment. The cunning strategist has gathered the powerful remnants of the Empire’s war machine, preparing to execute the late Emperor Palpatine’s final plan. As the Imperial fleet orbits Jakku, an armada of Republic fighters closes in to finish what began at Endor. Norra and her crew soar into the heart of an apocalyptic clash that will leave land and sky alike scorched. And the future of the galaxy will finally be decided. Praise for Chuck Wendig’s Aftermath “Star Wars: Aftermath [reveals] what happened after the events of 1983’s Return of the Jedi. It turns out, there’s more than just the Empire for the good guys to worry about.”—The Hollywood Reporter “The Force is strong with Star Wars: Aftermath.”—Alternative Nation “The Star Wars universe is fresh and new again, and just as rich and mysterious as it always was.”—Den of Geek! Aftermath: Life Debt “Compulsively readable, the kind of caramel-corn book you just keep stuffing in your face until it’s gone.”—Tordotcom “Man oh man, this is good stuff. [Life Debt] reveals what Han and Chewie were up to after Return of the Jedi.”—io9 “Gripping reading . . . [This novel] hits the ground running.”—New York Daily News"
  },
  {
    "youtiniTitle": "Alphabet Squadron",
    "foundTitle": "Alphabet Squadron (Star Wars)",
    "description": "The first novel in a new trilogy starring veteran New Republic pilots! On the brink of victory in a brutal war, five New Republic pilots transform from hunted to hunters in this epic Star Wars adventure. Set after Return of the Jedi, Alphabet Squadron follows a unique team, each flying a different class of starfighter as they struggle to end their war once and for all. The Emperor is dead. His final weapon has been destroyed. The Imperial Army is in disarray. In the aftermath, Yrica Quell is just one of thousands of defectors from her former cause living in a deserters’ shantytown—until she is selected to join Alphabet Squadron. Cobbled together from an eclectic assortment of pilots and starfighters, the five members of Alphabet are tasked by New Republic general Hera Syndulla herself. Like Yrica, each is a talented pilot struggling to find their place in a changing galaxy. Their mission: to track down and destroy the mysterious Shadow Wing, a lethal force of TIE fighters exacting bloody, reckless vengeance in the twilight of their reign. The newly formed unit embodies the heart and soul of the Rebellion: ragtag, resourceful, scrappy, and emboldened by their most audacious victory in decades. But going from underdog rebels to celebrated heroes isn’t as easy as it seems, and their inner demons threaten them as much as their enemies among the stars. The wayward warriors of Alphabet Squadron will have to learn to fly together if they want to protect the new era of peace they’ve fought so hard to achieve. Part of a Marvel and Del Rey crossover event, Alphabet Squadron is the counterpart to Marvel’s TIE Fighter miniseries, which follows the exploits of Shadow Wing as they scheme to thwart the New Republic."
  },
  {
    "youtiniTitle": "Battlefront: Twilight Company",
    "foundTitle": "Battlefront",
    "description": "The bravest soldiers. The toughest warriors. The ultimate survivors. Among the stars and across the vast expanses of space, the Galactic Civil War rages. On the battlefields of multiple worlds in the Mid Rim, legions of ruthless stormtroopers-bent on crushing resistance to the Empire wherever it arises-are waging close and brutal combat against an armada of freedom fighters. In the streets and alleys of ravaged cities, the front-line forces of the Rebel Alliance are taking the fight to the enemy, pushing deeper into Imperial territory and grappling with the savage flesh-and-blood realities of war on the ground. Leading the charge are the soldiers-men and women, human and nonhuman-of the Sixty-First Mobile Infantry, better known as Twilight Company. Hard-bitten, war-weary, and ferociously loyal to one another, the members of this renegade outfit doggedly survive where others perish, and defiance is their most powerful weapon against the deadliest odds. When orders come down for the rebels to fall back in the face of superior opposition numbers and firepower, Twilight reluctantly complies. Then an unlikely ally radically changes the strategic equation-and gives the Alliance's hardest-fighting warriors a crucial chance to turn retreat into resurgence. Orders or not, alone and outgunned but unbowed, Twilight Company locks, loads, and prepares to make its boldest maneuver-trading down-and-dirty battle in the trenches for a game-changing strike at the ultimate target: the very heart of the Empire's military machine."
  },
  {
    "youtiniTitle": "Before the Awakening",
    "foundTitle": "Star Wars: Before the Awakening",
    "description": "A companion piece to the \"Journey to Star Wars: The Force Awakens\" character novels, Star Wars: Before the Awakening is an anthology book that focuses on the lives of Rey, Finn, and Poe before the events of the Star Wars: The Force Awakens."
  },
  {
    "youtiniTitle": "Canto Bight",
    "foundTitle": "Canto Bight (Star Wars)",
    "description": "As seen in Star Wars: The Last Jedi, welcome to the casino city of Canto Bight. A place where exotic aliens, captivating creatures, and other would-be high rollers are willing to risk everything to make their fortunes. Set across one fateful evening, these four interconnected stories explore the deception and danger of the lavish casino city. • An honest salesman meets a career criminal as a dream vacation turns into the worst nightmare imaginable, in a story by Saladin Ahmed. • Dreams and schemes collide when a deal over a priceless bottle of wine becomes a struggle for survival, as told by Mira Grant. • Old habits die hard when a servant is forced into a mad struggle for power among Canto Bight’s elite, in a tale by Rae Carson • A deadbeat gambler has one last chance to turn his luck around; all he has to do is survive one wild night, as told by John Jackson Miller. In Canto Bight, one is free to revel in excess, untouched from the problems of a galaxy once again descending into chaos and war. Dreams can become reality, but the stakes have never been higher—for there is a darkness obscured by all the glamour and luxury."
  },
  {
    "youtiniTitle": "Catalyst: A Rogue One Novel",
    "foundTitle": "Catalyst (Star Wars)",
    "description": "NEW YORK TIMES BESTSELLER * Lauded Star Wars author James Luceno returns to pen an intense tale of ambition and betrayal that sets the stage for Rogue One: A Star Wars Story. War is tearing the galaxy apart. For years the Republic and the Separatists have battled across the stars, each building more and more deadly technology in an attempt to win the war. As a member of Chancellor Palpatine's top secret Death Star project, Orson Krennic is determined to develop a superweapon before the Republic's enemies can. And an old friend of Krennic's, the brilliant scientist Galen Erso, could be the key. Galen's energy-focused research has captured the attention of both Krennic and his foes, making the scientist a crucial pawn in the galactic conflict. But after Krennic rescues Galen, his wife, Lyra, and their young daughter, Jyn, from Separatist kidnappers, the Erso family is deeply in Krennic's debt. Krennic then offers Galen an extraordinary opportunity: to continue his scientific studies with every resource put utterly at his disposal. While Galen and Lyra believe that his energy research will be used purely in altruistic ways, Krennic has other plans that will finally make the Death Star a reality. Trapped in their benefactor's tightening grasp, the Ersos must untangle Krennic's web of deception to save themselves and the galaxy itself."
  },
  {
    "youtiniTitle": "Dark Disciple",
    "foundTitle": "Dark Disciple: Star Wars",
    "description": "Based on unproduced episodes of Star Wars: The Clone Wars, this new novel features Asajj Ventress, former Sith apprentice turned bounty hunter and one of the great antiheroes in the Star Wars galaxy. The only way to bring down the Sith’s most dangerous warrior may be to join forces with the dark side. In the war for control of the galaxy between the armies of the dark side and the Republic, former Jedi Master turned ruthless Sith Lord Count Dooku has grown ever more brutal in his tactics. Despite the powers of the Jedi and the military prowess of their clone army, the sheer number of fatalities is taking a terrible toll. And when Dooku orders the massacre of a flotilla of helpless refugees, the Jedi Council feels it has no choice but to take drastic action: targeting the man responsible for so many war atrocities, Count Dooku himself. But the ever-elusive Dooku is dangerous prey for even the most skilled hunter. So the Council makes the bold decision to bring both sides of the Force’s power to bear—pairing brash Jedi Knight Quinlan Vos with infamous one-time Sith acolyte Asajj Ventress. Though Jedi distrust for the cunning killer who once served at Dooku’s side still runs deep, Ventress’s hatred for her former master runs deeper. She’s more than willing to lend her copious talents as a bounty hunter—and assassin—to Vos’s quest. Together, Ventress and Vos are the best hope for eliminating Dooku—as long as the emerging feelings between them don’t compromise their mission. But Ventress is determined to have her retribution and at last let go of her dark Sith past. Balancing the complicated emotions she feels for Vos with the fury of her warrior’s spirit, she resolves to claim victory on all fronts—a vow that will be mercilessly tested by her deadly enemy . . . and her own doubt. Praise for Dark Disciple “Reading Dark Disciple really feels like you’re watching some of the best episodes of The Clone Wars.”—EUCantina “Emotionally charged . . . Christie Golden does a wonderful job of capturing the characters.”—Roqoo Depot “A cool inclusion into the Star Wars mythos . . . Ventress and Vos have a cool and compelling dynamic, and are used to explore more of what it means to flirt with the Dark Side of the Force.”—IGN “[The Clone Wars have been] a huge part of the Star Wars brand for years, and [Christie] Golden manages to craft a story worthy of the themes and characters that fans have come to relate to. . . . [She] uses this opportunity to craft Dark Disciple into a spy/espionage thriller.”—Tech Times “Golden especially excelled at bringing Ventress’s biting but appealing personality to life. . . . She’s very much a woman trying to find her way, and Dark Disciple adds nuance.”—Nerdist “Smart, captivating, and unforgettable . . . among the finest in Star Wars storytelling.”—Coffee with Kenobi"
  },
  {
    "youtiniTitle": "Doctor Aphra (Script)",
    "foundTitle": "Alumni Associated",
    "description": "An upcoming book to be published by Penguin Random House."
  },
  {
    "youtiniTitle": "Dooku: Jedi Lost (Script)",
    "foundTitle": "Dooku: Jedi Lost (Star Wars)",
    "description": "Delve into the history of the sinister Count Dooku in the original script to the thrilling Star Wars audio production! Darth Tyranus. Count of Serenno. Leader of the Separatists. A red saber, unsheathed in the dark. But who was he before he became the right hand of the Sith? As Dooku courts a new apprentice, the hidden truth of the Sith Lord's past begins to come to light. Dooku's life began as one of privilege—born within the stony walls of his family's estate, orbited by the Funeral Moon where the bones of his ancestors lie interred. But soon, his Jedi abilities are recognized, and he is taken from his home to be trained in the ways of the Force by the legendary Master Yoda. As he hones his power, Dooku rises through the ranks, befriending fellow Jedi Sifo-Dyas and taking a Padawan of his own, the promising Qui-Gon Jinn—and tries to forget the life that he once led. But he finds himself drawn by a strange fascination with the Jedi Master Lene Kostana, and the mission she undertakes for the Order: finding and studying ancient relics of the Sith, in preparation for the eventual return of the deadliest enemies the Jedi have ever faced. Caught between the world of the Jedi, the ancient responsibilities of his lost home, and the alluring power of the relics, Dooku struggles to stay in the light—even as the darkness begins to fall."
  },
  {
    "youtiniTitle": "Galaxy’s Edge: A Crash of Fate",
    "foundTitle": "Star Wars: Galaxy's Edge: A Crash of Fate",
    "description": "A YA novel filled with adventure and romance set in the world of Galaxy's Edge, the Star Wars-themed land coming to Disneyland and Walt Disney World tin 2019.Izzy and Jules were childhood friends, climbing the spires of Batuu, inventing silly games, and dreaming of adventures they would share one day. Then, Izzy's family left abruptly, without even a chance to say goodbye. Izzy's life became one of constant motion, traveling from one world to the next, until her parents were killed and she became a low-level smuggler to make ends meet. Jules remained on Batuu, eventually becoming a farmer like his father, but always yearning for something more. Now, thirteen years after she left, Izzy is returning to Batuu. She's been hired to deliver a mysterious parcel, and she just wants to finish the job and get gone. But upon arrival at Black Spire Outpost she runs smack into the one person who still means something to her after all this time: Jules. The attraction between them is immediate, yet despite Jules seeming to be everything she's ever needed, Izzy hesitates. How can she drag this good-hearted man into the perilous life she's chosen? Jules has been trying to figure out his future, but now all he knows for certain is that he wants to be with Izzy. How can he convince her to take a chance on someone who's never left the safety of his homeworld? When Izzy's job goes wrong, the two childhood friends find themselves on the run. And all their secrets will be revealed as they fight to stay alive..."
  },
  {
    "youtiniTitle": "Last Shot",
    "foundTitle": "Last Shot (Star Wars)",
    "description": "NEW YORK TIMES BESTSELLER - Han Solo and Lando Calrissian are reunited on the Millennium Falcon in a galaxy-spanning novel inspired by Solo: A Star Wars Story. But even the fastest ship in the universe can't outrun the past. . . . THEN: It's one of the galaxy's most dangerous secrets: a mysterious transmitter with unknown power and a reward for its discovery that most could only dream of claiming. But those who fly the Millennium Falcon throughout its infamous history aren't your average scoundrels. Not once, but twice, the crew of the Falcon tries to claim the elusive prize--first, Lando Calrissian and the droid L3-37 at the dawn of an ambitious career, and later, a young and hungry Han Solo with the help of his copilot, Chewbacca. But the device's creator, the volatile criminal Fyzen Gor, isn't interested in sharing. And Gor knows how to hold a grudge. . . . NOW: It's been ten years since the rebel hero Han Solo last encountered Fyzen Gor. After mounting a successful rebellion against the Empire and starting a family with an Alderaanian princess, Han hasn't given much thought to the mad inventor. But when Lando turns up at Han's doorstep in the middle of the night, it's Fyzen's assassins that he's running from. And without Han's help, Lando--and all life on Cloud City--will be annihilated. With the assistance of a young hotshot pilot, an Ewok slicer prodigy, the woman who might be the love of Lando's life, and Han's best and furriest friend, the two most notorious scoundrels in the New Republic are working together once more. They'll have to journey across the stars--and into the past--before Gor uses the device's power to reshape the galaxy. Praise for Last Shot \"Action-packed in all the right ways.\"--Tordotcom \"A fun, breezy read, with plenty of humor, Ewok hackers, murderous robots, and rousing fight scenes as Han and Lando go from scrape to scrape [to] track down a long-forgotten enemy.\"--The Verge \"The flat-out funniest Star Wars novel to date.\"--Alternative Nation"
  },
  {
    "youtiniTitle": "Leia: Princess of Alderaan",
    "foundTitle": "Star Wars Leia, Princess of Alderaan",
    "description": "Explore the beginning of Leia's participation in the Rebellion and the origin of her friendship with Amilyn Holdo from The Last Jedi! Sixteen-year-old Princess Leia Organa faces the most challenging task of her life so far: proving herself in the areas of body, mind, and heart to be formally named heir to the throne of Alderaan. She's taking rigorous survival courses, practicing politics, and spearheading relief missions to worlds under Imperial control. But Leia has worries beyond her claim to the crown. Her parents, Breha and Bail, aren't acting like themselves lately; they are distant and preoccupied, seemingly more concerned with throwing dinner parties for their allies in the Senate than they are with their own daughter. Determined to uncover her parents' secrets, Leia starts down an increasingly dangerous path that puts her right under the watchful eye of the Empire. And when Leia discovers what her parents and their allies are planning behind closed doors, she finds herself facing what seems like an impossible choice: dedicate herself to the people of Alderaan (including the man she loves) or to the galaxy at large, which is in desperate need of a rebel hero..."
  },
  {
    "youtiniTitle": "Lords of the Sith",
    "foundTitle": "Lords of the Sith: Star Wars",
    "description": "NEW YORK TIMES BESTSELLER A long time ago in a galaxy far, far away. . . . When the Emperor and his notorious apprentice, Darth Vader, find themselves stranded in the middle of insurgent action on an inhospitable planet, they must rely on each other, the Force, and their own ruthlessness to prevail. “It appears things are as you suspected, Lord Vader. We are indeed hunted.” Anakin Skywalker, Jedi Knight, is just a memory. Darth Vader, newly anointed Sith Lord, is ascendant. The Emperor’s chosen apprentice has swiftly proven his loyalty to the dark side. Still, the history of the Sith Order is one of duplicity, betrayal, and acolytes violently usurping their Masters—and the truest measure of Vader’s allegiance has yet to be taken. Until now. On Ryloth, a planet crucial to the growing Empire as a source of slave labor and the narcotic known as “spice,” an aggressive resistance movement has arisen, led by Cham Syndulla, an idealistic freedom fighter, and Isval, a vengeful former slave. But Emperor Palpatine means to control the embattled world and its precious resources—by political power or firepower—and he will be neither intimidated nor denied. Accompanied by his merciless disciple, Darth Vader, he sets out on a rare personal mission to ensure his will is done. For Syndulla and Isval, it’s the opportunity to strike at the very heart of the ruthless dictatorship sweeping the galaxy. And for the Emperor and Darth Vader, Ryloth becomes more than just a matter of putting down an insurrection: When an ambush sends them crashing to the planet’s surface, where inhospitable terrain and an army of resistance fighters await them, they will find their relationship tested as never before. With only their lightsabers, the dark side of the Force, and each other to depend on, the two Sith must decide if the brutal bond they share will make them victorious allies or lethal adversaries. Praise for Lords of the Sith “A compelling tale [that] gives us new insight into the relationship between Darth Vader and his master, Emperor Palpatine.”—New York Daily News “Endlessly fascinating . . . a tale [that is] not just compelling but completely thrilling.”—Big Shiny Robot “The best novel so far in this new era of official canon Star Wars stories.”—IGN “Packed with action . . . hard to put down.”—Seattle Geekly"
  },
  {
    "youtiniTitle": "Lost Stars",
    "foundTitle": "Star Wars Lost Stars",
    "description": "The reign of the Galactic Empire has reached the Outer Rim planet of Jelucan, where aristocratic Thane Kyrell and rural villager Ciena Ree bond over their love of flying. Enrolling at the Imperial Academy is nothing less than a dream come true for both of them. But Thane sours on the dream when he sees firsthand the horrific tactics the Empire uses to maintain its ironclad rule. Bitter and disillusioned, he joins the fledgling Rebellion--putting Ciena in an unbearable position between her loyalty to the Empire and her love for the man she's known since childhood. Now on opposite sides of the war, will these friends turned foes ever find a way to be together, or will duty tear them--and the galaxy--apart?"
  },
  {
    "youtiniTitle": "Most Wanted",
    "foundTitle": "Star Wars Most Wanted",
    "description": "Set before the events of Solo: A Star Wars Story! Han and Qi'ra don't have a lot in common other than not having a lot. They're street kids on the industrial planet Corellia, doing whatever it takes to get by, dreaming of something more. They each jump at a chance to prove themselves in the perilous world of Corellia's criminal underbelly, only to discover they are on the same mission for the same unscrupulous boss. When the job goes disastrously wrong, Han and Qi'ra are on the run--from pirates, a droid crime syndicate, the Empire, and their boss--and will have to learn to trust each other if they are going to survive."
  },
  {
    "youtiniTitle": "Phasma",
    "foundTitle": "Phasma",
    "description": "NEW YORK TIMES BESTSELLER * Discover Captain Phasma's mysterious history in this \"Journey to Star Wars: The Last Jedi\" novel. One of the most cunning and merciless officers of the First Order, Captain Phasma commands the favor of her superiors, the respect of her peers, and the terror of her enemies. But for all her renown, Phasma remains as virtually unknown as the impassive expression on her gleaming chrome helmet. Now, an adversary is bent on unearthing her mysterious origins--and exposing a secret she guards as zealously and ruthlessly as she serves her masters. Deep inside the Battlecruiser Absolution, a captured Resistance spy endures brutal interrogation at the hands of a crimson-armored stormtrooper--Cardinal. But the information he desires has nothing to do with the Resistance or its covert operations against the First Order. What the mysterious stormtrooper wants is Phasma's past--and with it whatever long-buried scandal, treachery, or private demons he can wield against the hated rival who threatens his own power and privilege in the ranks of the First Order. His prisoner has what Cardinal so desperately seeks, but she won't surrender it easily. As she wages a painstaking war of wills with her captor, bargaining for her life in exchange for every precious revelation, the spellbinding chronicle of the inscrutable Phasma unfolds. But this knowledge may prove more than just dangerous once Cardinal possesses it--and once his adversary unleashes the full measure of her fury. Praise for Phasma \"Fury Road meets The Force Awakens . . . a much-needed origin story for one of the new Star Wars saga's most mysterious characters.\"--The Verge \"Captain Phasma is the badass warrior that we all expected her to be.\"--Forces of Geek \"Dark, gripping, and entertaining.\"--Roqoo Depot \"Fabulous, utterly engrossing.\"--Kirkus Reviews"
  },
  {
    "youtiniTitle": "Poe Dameron: Free Fall",
    "foundTitle": "Star Wars Poe Dameron: Free Fall",
    "description": "Learn more about the dashing hero from the new Star Wars films! Telling a story hinted at in The Rise of Skywalker.... It's been a few years since Poe's mother passed away, and Poe and his father, who was a pilot for the Rebellion, have had more and more trouble connecting. Not sure what he wants to do with his life, teenage Poe runs away from home to find adventure, and to figure out what kind of man he is meant to be."
  },
  {
    "youtiniTitle": "Queen's Peril",
    "foundTitle": "Star Wars Queen's Peril",
    "description": "When fourteen-year-old Padmé Naberrie wins the election for Queen of Naboo, she adopts the name Amidala and leaves her family to the rule from the royal palace. To keep her safe and secure, she'll need a group of skilled handmaidens who can be her assistants, confidantes, defenders, and decoys. Each girl is selected for her particular talents, but it will be up to Padmé to unite them as a group. When Naboo is invaded by forces of the Trade Federation, Queen Amidala and her handmaidens will face the greatest test--of themselves, and of each other."
  },
  {
    "youtiniTitle": "Rebel Rising",
    "foundTitle": "Star Wars Rebel Rising",
    "description": "When Jyn Erso was five years old, her mother was murdered and her father taken from her to serve the Empire. But despite the loss of her parents she is not completely alone-Saw Gerrera, a man willing to go to any extremes necessary in order to resist Imperial tyranny, takes her in as his own, and gives her not only a home but all the abilities and resources she needs to becomea rebel herself. Jyn dedicates herself to the cause-and the man. But fighting alongside Saw and his people brings with it danger and the question of just how far Jyn is willing to go as one of Saw's soldiers. When she faces an unthinkable betrayal that shatters her world, Jyn will have to pull the pieces of herself back together and figure out what she truly believes in... and who she can really trust."
  },
  {
    "youtiniTitle": "Resistance Reborn",
    "foundTitle": "Resistance Reborn (Star Wars)",
    "description": "In this pivotal prequel to Star Wars: The Rise of Skywalker, the heroes of the Resistance—Poe Dameron, General Leia Organa, Rey, and Finn—must fight back from the edge of oblivion. The Resistance is in ruins. In the wake of their harrowing escape from Crait, what was once an army has been reduced to a handful of wounded heroes. Finn, Poe, Rey, Rose, Chewbacca, Leia Organa—their names are famous among the oppressed worlds they fight to liberate. But names can only get you so far, and Leia’s last desperate call for aid has gone unanswered. From the jungles of Ryloth to the shipyards of Corellia, the shadow of the First Order looms large, and those with the bravery to face the darkness are scattered and isolated. If hope is to survive, the Resistance must journey throughout the galaxy, seeking out more leaders—including those who, in days gone by, helped a nascent rebellion topple an empire. Battles will be fought, alliances will be forged, and the Resistance will be reborn."
  },
  {
    "youtiniTitle": "Return of the Jedi: Beware the Power of the Dark Side!",
    "foundTitle": "Star Wars: Return of the Jedi Beware the Power of the Dark Side!",
    "description": "It's the Star Wars story with EVERYTHING: Jabba, Boba, Wicket, Rebo, Salacious Crumb, Nien Nunb, \"It's a trap,\" Luke doing a flip and catching his lightsaber, speeder bikes, Yoda, Ghost Yoda, the Rancor, the Falcon, Wedge, Lando, Luke, Leia, han, Chewie, C-3PO, R2... but there's also a second Death Star, the Emperor's hideous evil smile, and Luke's final confrontation with Darth Vader! It's a lot, but is it too much? Of course not!"
  },
  {
    "youtiniTitle": "Rogue One",
    "foundTitle": "Rogue One",
    "description": "The official novelization of the upcoming film Rogue One: A Star Wars Story, starring a band of rebels on a daring mission to steal the Death Star plans"
  },
  {
    "youtiniTitle": "Rogue One (YA)",
    "foundTitle": "Star Wars vs. Star Trek",
    "description": "Could a Jedi knight use his light saber to deflect a beam from a phaser? Which aliens are cooler: the Cardassians or the Chazrach? Have any Federation ships ever made the Kessel run in less than twelve parsecs? And most important, in a fight between the Empire and the Federation, who would win? Ever since Princess Leia's starship hovered into sight on the silver screen, fans of Star Wars and Star Trek have been debating these questions. Now, side by side, they can line up aliens, technology, story points, weaponry, and heroes from the two great science fiction/fantasy stories of our age. For fans everywhere, this volume offers detailed information about both universes, as well as trivia, quizzes, quotes, and information drawn from these two iconic settings. So phasers on stun and light sabers at the ready! It's time for the duel to begin."
  },
  {
    "youtiniTitle": "Solo: A Star Wars Story: Expanded Edition",
    "foundTitle": "Solo: A Star Wars Story: Expanded Edition",
    "description": "Don’t miss the exclusive content in this thrilling adaptation of Solo: A Star Wars Story, with scenes from alternate versions of the script including Han Solo’s time in the Imperial Navy, Qi’ra’s past, the beginnings of the rebellion, and more! Though Han Solo has thrilled Star Wars fans for decades, the notorious wisecracking scoundrel was chasing adventure and dodging trouble long before he walked into the cantina at Mos Eisley spaceport. Young Han dreams of someday soaring into space at the helm of his own starship and leaving his home, the gritty industrial planet Corellia, far behind. But as long as he’s trapped in a life of poverty and crime—and under the thumb of the sinister Lady Proxima and her brutal street gang—reaching the distant stars seems impossible. When Han tries to escape with his girlfriend and partner-in-crime, Qi’ra, he makes it out—but she doesn’t. Desperate for a way to find his own offworld vessel and free her, Han enlists in the Imperial Navy—the last place for a rebellious loner who doesn’t play well with others. When the Empire clips his wings, Han goes rogue and plunges into the shady world of smugglers, gamblers, and con artists. There he meets the charming and cunning high roller Lando Calrissian, makes an unlikely friend in a cantankerous Wookiee called Chewbacca, and first lays eyes on the Millennium Falcon. To snag his piece of the outlaw pie, Han joins a crew of pirates to pull off a risky heist. The stakes are high, the danger is great, and the odds are slim. But never tell Han Solo the odds. Praise for Solo: A Star Wars Story “Mur Lafferty has given us the best adaptation of a Star Wars film yet.”—Star Wars News Net “If you liked the movie but were left wanting more, this novel has exactly what you need.”—CNET “A fun adventure tale within the larger Star Wars franchise that goes beyond the run-of-the-mill novelization treatment to explore a new bit of the world that we haven’t yet seen.”—The Verge"
  },
  {
    "youtiniTitle": "Star Wars Episode IX: The Rise Of Skywalker - Expanded Edition",
    "foundTitle": "Star Wars: Rise of Skywalker (Expanded Edition)"
  },
  {
    "youtiniTitle": "Star Wars Episode VIII: The Last Jedi: Expanded Edition",
    "foundTitle": "The Last Jedi: Expanded Edition (Star Wars)",
    "description": "NEW YORK TIMES BESTSELLER • Written with input from director Rian Johnson, this official adaptation of Star Wars: The Last Jedi expands on the film to include scenes from alternate versions of the script and other additional content. From the ashes of the Empire has arisen another threat to the galaxy’s freedom: the ruthless First Order. Fortunately, new heroes have emerged to take up arms—and perhaps lay down their lives—for the cause. Rey, the orphan strong in the Force; Finn, the ex-stormtrooper who stands against his former masters; and Poe Dameron, the fearless X-wing pilot, have been drawn together to fight side-by-side with General Leia Organa and the Resistance. But the First Order’s Supreme Leader Snoke and his merciless enforcer Kylo Ren are adversaries with superior numbers and devastating firepower at their command. Against this enemy, the champions of light may finally be facing their extinction. Their only hope rests with a lost legend: Jedi Master Luke Skywalker. Where the action of Star Wars: The Force Awakens ended, Star Wars: The Last Jedi begins, as the battle between light and dark climbs to astonishing new heights. Featuring thrilling photos from the hit movie"
  },
  {
    "youtiniTitle": "The Empire Strikes Back: So You Want to Be a Jedi?",
    "foundTitle": "Star Wars: The Empire Strikes Back So You Want to Be a Jedi?",
    "description": "So you want to be a Jedi? It seems coo. You can move things with you mind. Control people with your thoughts. Oh, and the lightsabers. Yeah, those are awesome. But it's not all mind control and weaponized flashlights. Being a Jedi is hard work. Also, there are bad guys. Lots of bad guys. Who want to kill you. Do you still want to be a Jedi? If so, this book is for you!"
  },
  {
    "youtiniTitle": "The High Republic: Into the Dark",
    "foundTitle": "Star Wars Project Luminous YA Novel"
  },
  {
    "youtiniTitle": "The High Republic: Light of the Jedi",
    "foundTitle": "Star Wars: Light of the Jedi (The High Republic)",
    "description": "#1 NEW YORK TIMES BESTSELLER • Long before the First Order, before the Empire, before even The Phantom Menace . . . Jedi lit the way for the galaxy in The High Republic It is a golden age. Intrepid hyperspace scouts expand the reach of the Republic to the furthest stars, worlds flourish under the benevolent leadership of the Senate, and peace reigns, enforced by the wisdom and strength of the renowned order of Force users known as the Jedi. With the Jedi at the height of their power, the free citizens of the galaxy are confident in their ability to weather any storm But the even brightest light can cast a shadow, and some storms defy any preparation. When a shocking catastrophe in hyperspace tears a ship to pieces, the flurry of shrapnel emerging from the disaster threatens an entire system. No sooner does the call for help go out than the Jedi race to the scene. The scope of the emergence, however, is enough to push even Jedi to their limit. As the sky breaks open and destruction rains down upon the peaceful alliance they helped to build, the Jedi must trust in the Force to see them through a day in which a single mistake could cost billions of lives. Even as the Jedi battle valiantly against calamity, something truly deadly grows beyond the boundary of the Republic. The hyperspace disaster is far more sinister than the Jedi could ever suspect. A threat hides in the darkness, far from the light of the age, and harbors a secret that could strike fear into even a Jedi’s heart."
  },
  {
    "youtiniTitle": "The High Republic: Out Of The Shadows",
    "foundTitle": "Star Wars the High Republic YA Novel #2"
  },
  {
    "youtiniTitle": "The Legends of Luke Skywalker",
    "foundTitle": "Journey to Star Wars: The Last Jedi The Legends of Luke Skywalker",
    "description": "As a cargo ship rockets across thegalaxy to Canto Bight, the deckhands on board trade stories about legendary JediKnight Luke Skywalker. But are the stories of iconic and mysterious LukeSkywalker true, or merely tall tales passed from one corner of the galaxy toanother? Is Skywalker really a famous Jedi hero, an elaborate charlatan,or even part droid? The deckhands will have to decide for themselves when theyhear The Legends of Luke Skywalker. A collection of myths and tall-tales about the legendary Jedi Luke Skywalker, written by Nebula, Hugo, and World Fantasy award-winning author Ken Liu."
  },
  {
    "youtiniTitle": "The Mandalorian (original novel)",
    "foundTitle": "The Mandalorian Original Novel (Star Wars)"
  },
  {
    "youtiniTitle": "The Rise of the Empire",
    "foundTitle": "The Rise of the Empire: Star Wars",
    "description": "Witness the rise of the Empire with these two thrilling Star Wars novels—plus exclusive short stories by Melissa Scott, John Jackson Miller, and Jason Fry! TARKIN “Compelling . . . The villains of Star Wars are as much fun as the good guys.”—New York Daily News Under Governor Wilhuff Tarkin’s guidance, an ultimate weapon of unparalleled destruction—the so-called Death Star—moves ever closer to becoming a terrifying reality. Until then, insurgency remains a genuine threat. Guerrilla attacks by an elusive band of freedom fighters must be countered with swift and brutal action—a mission the Emperor entrusts to his most formidable agents: Darth Vader, the fearsome new Sith enforcer, and Tarkin, whose tactical cunning and cold-blooded efficiency will pave the way for the Empire’s supremacy—and its enemies’ extinction. A NEW DAWN Foreword by Dave Filoni “A story with pacing and dialogue that feels like classic Star Wars.”—Nerdist Ever since the Jedi were marked for death, Kanan Jarrus has devoted himself to staying alive rather than serving the Force. So when he discovers a conflict brewing between Imperial forces and desperate revolutionaries, he’s not about to get caught in the crossfire. Then the brutal death of a friend forces him to choose between bowing down to fear or standing up to fight. But Jarrus won’t be fighting alone. Soon he is joined by Hera Syndulla—a mysterious agent provocateur with motives of her own—in challenging the Empire for the sake of a world and its people."
  },
  {
    "youtiniTitle": "Thrawn Ascendancy: Greater Good",
    "foundTitle": "Jackal",
    "description": "An upcoming book to be published by Penguin Random House."
  },
  {
    "youtiniTitle": "Thrawn: Alliances",
    "foundTitle": "Thrawn: Alliances (Star Wars)",
    "description": "#1 NEW YORK TIMES BESTSELLER • Grand Admiral Thrawn and Darth Vader team up against a threat to the Empire in this thrilling novel from bestselling author Timothy Zahn. “I have sensed a disturbance in the Force.” Ominous words under any circumstances, but all the more so when uttered by Emperor Palpatine. On Batuu, at the edges of the Unknown Regions, a threat to the Empire is taking root—its existence little more than a glimmer, its consequences as yet unknowable. But it is troubling enough to the Imperial leader to warrant investigation by his most powerful agents: ruthless enforcer Lord Darth Vader and brilliant strategist Grand Admiral Thrawn. Fierce rivals for the emperor’s favor, and outspoken adversaries on Imperial affairs—including the Death Star project—the formidable pair seem unlikely partners for such a crucial mission. But the Emperor knows it’s not the first time Vader and Thrawn have joined forces. And there’s more behind his royal command than either man suspects. In what seems like a lifetime ago, General Anakin Skywalker of the Galactic Republic, and Commander Mitth’raw’nuruodo, officer of the Chiss Ascendancy, crossed paths for the first time. One on a desperate personal quest, the other with motives unknown . . . and undisclosed. But facing a gauntlet of dangers on a far-flung world, they forged an uneasy alliance—neither remotely aware of what their futures held in store. Now, thrust together once more, they find themselves bound again for the planet where they once fought side by side. There they will be doubly challenged—by a test of their allegiance to the Empire . . . and an enemy that threatens even their combined might. Praise for Thrawn: Alliances “It’s a science fiction beach read in the best way, brisk and amusing, with some cool additions to the Star Wars galaxy.”—Den of Geek “Like all of Zahn’s novels set in a galaxy far, far away, it’s an essential read for anyone looking for an artistically done adventure.”—CNET"
  },
  {
    "youtiniTitle": "Life Day Treasury",
    "foundTitle": "Star Wars Life Day Treasury",
    "description": "Cozy up with this collection of holiday-themed midwinter stories from throughout the galaxy far, far away! From George Mann and Grant Griffin, the same team that brought us the stunning Star Wars: Myths & Fables and Star Wars: Dark Legends--with the addition of best-selling author Cavan Scott--this collection of eight myths and fables told around winter fires and high-tech heating pods across the galaxy will bring holiday joy to young and old Star Wars fans alike. From Jedi in the city to Ewoks in the forest, from Wookiees to droids, in this charming collection you will find holiday feasts, ghostly apparitions, snowy adventures, and much more. Ultimately these are stories of hope in the darkest of days. Of family, found and otherwise. Of kindness. And of love. This is a holiday treasury that will be long remembered.... Complete your Star Wars collection with Star Wars: Dark Legends Star Wars: Myths & Fables"
  },
  {
    "youtiniTitle": "Ronin: A Visions Novel",
    "foundTitle": "Star Wars Visions: Ronin",
    "description": "NATIONAL BESTSELLER - A mysterious former Sith wanders the galaxy in this stunning Star Wars tale, an original novel inspired by the world of The Duel from the Star Wars Visions animated anthology. The Jedi are the most loyal servants of the Empire. Two decades ago, Jedi clans clashed in service to feuding lords. Sickened by this endless cycle, a sect of Jedi rebelled, seeking to control their own destiny and claim power in service of no master. They called themselves Sith. The Sith rebellion failed, succumbing to infighting and betrayal, and the once rival lords unified to create an Empire . . . but even an Empire at peace is not free from violence. Far on the edge of the Outer Rim, one former Sith wanders, accompanied only by a faithful droid and the ghost of a less civilized age. He carries a lightsaber, but claims lineage to no Jedi clan, and pledges allegiance to no lord. Little is known about him, including his name, for he never speaks of his past, nor his regrets. His history is as guarded as the red blade of destruction he carries sheathed at his side. As the galaxy's perpetual cycle of violence continues to interrupt his self-imposed exile, and he is forced to duel an enigmatic bandit claiming the title of Sith, it becomes clear that no amount of wandering will ever let him outpace the specters of his former life."
  },
  {
    "youtiniTitle": "The High Republic: Midnight Horizon",
    "foundTitle": "Star Wars the High Republic: Midnight Horizon",
    "description": "Centuries before the events of Star Wars: The Phantom Menace, in the era of the glorious High Republic, the Jedi are the guardians of peace and justice in the galaxy! The brave and wise Jedi Knights and their Padawans will be put to the ultimate test when they confront the anarchistic marauders known as the Nihil. But all is not as it seems... The New York Times best-selling series continues.... For light and life!"
  },
  {
    "youtiniTitle": "The High Republic: The Fallen Star",
    "foundTitle": "Star Wars: The Fallen Star (the High Republic)",
    "description": "In this gripping sequel to Star Wars: The Rising Storm, the light of the Jedi faces its darkest hour."
  },
  {
    "youtiniTitle": "Padawan",
    "foundTitle": "Star Wars: Padawan"
  },
  {
    "youtiniTitle": "Shadow of the Sith",
    "foundTitle": "Star Wars: Shadow of the Sith",
    "description": "Luke Skywalker and Lando Calrissian return in this essential novel set between Return of the Jedi and The Force Awakens. The Empire is dead. Nearly two decades after the Battle of Endor, the tattered remnants of Palpatine’s forces have fled to the farthest reaches of the galaxy. But for the heroes of the New Republic, danger and loss are ever-present companions, even in this newly forged era of peace. Jedi Master Luke Skywalker is haunted by visions of the dark side, foretelling an ominous secret growing somewhere in the depths of space, on a dead world called Exegol. The disturbance in the Force is undeniable . . . and Luke’s worst fears are confirmed when his old friend Lando Calrissian comes to him with reports of a new Sith menace. After Lando’s daughter was stolen from his arms, he searched the stars for any trace of his lost child. But every new rumor leads only to dead ends and fading hopes—until he crosses paths with Ochi of Bestoon, a Sith assassin tasked with kidnapping a young girl. Ochi’s true motives remain shrouded to Luke and Lando. For on a junkyard moon, a mysterious envoy of the Sith Eternal has bequeathed a sacred blade to the assassin, promising that it will answer the questions that have haunted him since the Empire fell. In exchange, he must complete a final mission: Return to Exegol with the key to the Sith’s glorious rebirth—Rey, the granddaughter of Darth Sidious himself. As Ochi hunts Rey and her parents to the edge of the galaxy, Luke and Lando race into the mystery of the Sith’s lingering shadow and aid a young family running for their lives."
  },
  {
    "youtiniTitle": "Brotherhood",
    "foundTitle": "Star Wars: Brotherhood",
    "description": "NEW YORK TIMES BESTSELLER • Obi-Wan Kenobi and Anakin Skywalker must stem the tide of the raging Clone Wars and forge a new bond as Jedi Knights in a high-stakes adventure set just after the events of Star Wars: Attack of the Clones. The Clone Wars have begun. Battle lines are being drawn throughout the galaxy. With every world that joins the Separatists, the peace guarded by the Jedi Order is slipping through their fingers. After an explosion devastates Cato Neimoidia, the jewel of the Trade Federation, the Republic is blamed and the fragile neutrality of the planet is threatened. The Jedi dispatch Obi-Wan Kenobi, one of the Order’s most gifted diplomatic minds, to investigate the crime and maintain the balance that has begun to dangerously shift. As Obi-Wan investigates with the help of a heroic Neimoidian guard, he finds himself working against the Separatists who hope to draw the planet into their conspiracy—and senses the sinister hand of Asajj Ventress in the mists that cloak the planet. Amid the brewing chaos, Anakin Skywalker rises to the rank of Jedi Knight. Despite the mandate that Obi-Wan travel alone—and his former master’s insistence that he listen this time—Anakin’s headstrong determination means nothing can stop him from crashing the party, and bringing along a promising but conflicted youngling. Once a Padawan to Obi-Wan, Anakin now finds himself on equal—but uncertain—footing with the man who raised him. The lingering friction between them increases the danger for everyone around them. The two knights must learn a new way to work together—and they must learn quickly, to save Cato Neimoidia and its people from the fires of war. To overcome the threat they face they must grow beyond master and apprentice. They must stand together as brothers."
  },
  {
    "youtiniTitle": "The High Republic: Tempest Runner (script)",
    "foundTitle": "Star Wars: Tempest Runner (The High Republic)",
    "description": "Delve into the cutthroat world of one of the High Republic’s greatest foes, the merciless Lourna Dee, in this full script for the Star Wars audio original Tempest Runner. The Nihil storm has raged through the galaxy, leaving chaos and grief in its wake. Few of its raiders are as vicious as the Tempest Runner Lourna Dee. She stays one step ahead of the Jedi Order at the helm of a vessel named after one of the deadliest monsters in the galaxy: herself. But no one can outrun the defenders of the High Republic forever. After the defeat of her crew, Lourna falls into the hands of the Jedi—but not before she hides her identity, becoming just another Nihil convict. Her captors fail to understand the beast they have cornered. Just like every fool she’s ever buried, their first mistake was keeping her alive. Lourna is determined to make underestimating her their last. Locked up on a Republic correctional ship, she’s dragged across the galaxy to repair the very damage she and her fellow Tempest Runners inflicted. But as Lourna plans her glorious escape, she makes alliances that grow dangerously close to friendships. Outside the Nihil—separated from her infamous ship, her terrifying arsenal, and her feared name—Lourna must carve her own path. But will it lead to redemption? Or will she emerge as a deadlier threat than ever before?"
  },
  {
    "youtiniTitle": "Star Wars Insider: The High Republic: Starlight Stories",
    "foundTitle": "Star Wars Insider: The High Republic: Starlight Stories",
    "description": "Titan Comics, publisher of the official Star Wars Insider magazine, is proud to offer an amazing collection of exclusive short stories for Star Wars: The High Republic. Written by The New York Times’ best-selling authors Cavan Scott, Charles Soule, and Justina Ireland, with supporting original illustrations by Louie De Martinis. EXPERIENCE THE GALAXY CENTURIES BEFORE THE STRUGGLE OF THE REBEL ALLIANCE AGAINST THE GALACTIC EMPIRE—AT THE HEIGHT OF THE JEDI ORDER! A compendium of tales from the High Republic era, told from aboard the incredible satellite station, the Starlight Beacon, collected for the first time from the pages of Star Wars Insider. All stories are written by The New York Times’ best-selling authors Cavan Scott, Charles Soule, and Justina Ireland. Also includes in-depth interviews with the story architects behind the best-selling publishing and multimedia initiative. Stories included: “Go Together” by Charles Soule “First Duty” by Cavan Scott “Hidden Danger” by Justina Ireland “Past Mistakes” by Cavan Scott “Shadows Remain” by Justina Ireland"
  },
  {
    "youtiniTitle": "The High Republic: Path of Deceit",
    "foundTitle": "Star Wars: The High Republic Path of Deceit",
    "description": "The #1 New York Times best-selling series continues...for life and light! A provocative and thrilling young adult adventure set in the world of the High Republic, 150 years before the storytelling of Phase I. Meet mysterious cult members, daring explorers, Jedi peacekeepers and more! Don't miss these other YA adventures of Star Wars: The High Republic! Into the Dark by Claudia Gray Out of the Shadows by Justina Ireland Midnight Horizon by Daniel José Older"
  },
  {
    "youtiniTitle": "The High Republic: Convergence",
    "foundTitle": "Star Wars: Convergence (The High Republic)",
    "description": "The next adventure in the High Republic begins expanding the new era of Star Wars, with a story set generations before Light of the Jedi. It is an age of exploration. Jedi travel the galaxy, expanding their understanding of the Force and all the worlds and beings connected by it. Meanwhile, the Republic, led by its two chancellors, works to unite worlds in an ever-growing community among near and distant stars. On the close orbiting planets of Eiram and E’ronoh, the growing pains of a galaxy with limited resources but unlimited ambition are felt keenly. Their hatred for each other has fueled half a decade of escalating conflict and now threatens to consume surrounding systems. The last hope for peace emerges when heirs from the two planets’ royal families plan to marry. Before lasting peace can be established, an assassination attempt targeting the couple tilts Eiram and E’ronoh back into all-out war. To save both worlds, Jedi Knight Gella Nattai volunteers to uncover the culprit, while Chancellor Kyong appoints her son, Axel Greylark, to represent the Republic’s interests in the investigation. But Axel’s deep distrust of the Jedi sparks against Gella’s faith in the Force. She’s never met such a puffed-up, privileged party boy, and he’s never met a more self-serious, relentless do-gooder. The more they work to untangle the shadowy web of the investigation, the more complicated the conspiracy appears to be. With accusations flying and potential enemies in every shadow, the pair will have to work together to have any hope of bringing the truth to light and saving both worlds."
  },
  {
    "youtiniTitle": "The Princess and the Scoundrel",
    "foundTitle": "Star Wars: the Princess and the Scoundrel",
    "description": "You are cordially invited to the wedding of Princess Leia Organa and Han Solo. The Death Star is destroyed. Darth Vader is dead. The Empire is desolated. But on the forest moon of Endor, amongst the chaos of a changing galaxy, time stands still for a princess and her scoundrel. After being frozen in carbonite, then risking everything for the Rebellion, Han is eager to stop living his life for other people. He and Leia have earned their future together, a thousand times over. And when he proposes to Leia, it's the first time in a long time he's had a good feeling about this. For Leia, a lifetime of fighting doesn't truly seem over. There is work still to do, penance to pay for the dark secret she now knows runs through her veins. Her brother, Luke, is offering her that chance -- one that comes with family and the promise of the Force. But when Han asks her to marry him, Leia finds her answer immediately on her lips . . . Yes. But happily ever after doesn't come easily. As soon as Han and Leia depart their idyllic ceremony on Endor for their honeymoon, they find themselves on the grandest and most glamorous stage of all- the Halcyon, a luxury vessel on a very public journey to the most wondrous worlds in the galaxy. Their marriage, and the peace and prosperity it represents, is a lightning rod for everyone in the galaxy -- including Imperial remnants still clinging to power. Facing their most desperate hour, the soldiers of the Empire have dispersed across the galaxy, retrenching on isolated worlds vulnerable to their influence. As the Halcyon travels from world to world, one thing becomes abundantly clear- The war is not over. But as danger draws closer, Han and Leia find that they fight their best battles not alone but as husband and wife."
  },
  {
    "youtiniTitle": "The High Republic: Cataclysm",
    "foundTitle": "Star Wars: Cataclysm (The High Republic)",
    "description": "The next adventure in The High Republic, set after the events of Convergence and The Battle of Jedha."
  },
  {
    "youtiniTitle": "The High Republic: Path of Vengeance",
    "foundTitle": "Star Wars: the High Republic Path of Vengeance"
  },
  {
    "youtiniTitle": "The High Republic: The Battle of Jedha (script)",
    "foundTitle": "Star Wars: The Battle of Jedha (The High Republic)",
    "description": "The full script for an all-new Star Wars audiobook original, set after the events of The High Republic: Convergence."
  },
  {
    "youtiniTitle": "Abyss",
    "foundTitle": "Abyss",
    "description": "Following a trail of clues across the galaxy, Luke Skywalker continues his quest to find the reasons behind Jacen Solo's dark downfall and to win redemption for the Jedi Order. Sojourning among the mysterious Aing-Tii monks has left Luke and his son Ben with no real answers, only the suspicion that the revelations they seek lie in the forbidden reaches of the distant Maw Cluster. There, hidden from the galaxy in a labyrinth of black holes, dwell the Mind Walkers: those whose power to transcend their bodies and be one with the Force is as seductive and intoxicating as it is potentially fatal. But it may be Luke's only path to the truth. Meanwhile, on Coruscant, the war of wills between Galactic Alliance Chief of State Natasi Daala and the Jedi Order is escalating. Outraged over the carbonite freezing of young Jedi Knights Valin and Jysella Horn after their inexplicable mental breakdowns, the Jedi are determined to defy Daala's martial tactics, override Council Master Kenth Hamner's wavering leadership, and deal on their own terms with the epidemic of madness preying on their ranks. As Han and Leia Solo, along with their daughter Jaina, join the fight to protect more stricken Knights from arrest, Jedi healers race to find a cure for the rapidly spreading affliction. But none of them realize the blaster barrel is already swinging in their directionand Chief Daala is about to pull the trigger. Nor do Luke and Ben, deep in the Maw Cluster and pushing their Force abilities beyond known limits, realize how close they areto the Sith strike squad bent on exterminating the Skywalkers, to a nexus of dark-side energy unprecedented in its power and its hunger, and to an explosive confrontation between opposing wielders of the Force from which only one Mastergood or evilcan emerge alive. From the Hardcover edition."
  },
  {
    "youtiniTitle": "Allegiance",
    "foundTitle": "Star Wars: Allegiance",
    "description": "A Star Wars novel set between the events of Epsiode IV: A New Hope and Epsiode V: The Empire Strikes Back, it features a younger Han, Leia, and Luke, as well as Mara Jade. Mara Jade, the Emperor's Hand, is looking into the illicit financial affairs of a planetary governor, hoping to find evidence that he might be funding the Rebellion. Luke, Han, and Chewbacca are sent on a mission to help some rebel supporters. Leia is busy being a diplomat, trying to drum up support for the Rebel Alliance. And a band of 5 stormtroopers, on the run after refusing a direct order, finds itself in the strange position of doing good deeds...and perhaps even aiding the Rebellion. The paths of all of them will crisscross back and forth as they come closer and closer to meeting up with one another...but never quite managing to."
  },
  {
    "youtiniTitle": "Allies",
    "foundTitle": "Allies",
    "description": "A precarious alliance between the Jedi and the Sith is compromised by a strange being that reaches out to Luke, interference from the Hutt family, and conflicting edicts by the Galactic Alliance."
  },
  {
    "youtiniTitle": "Ascension",
    "foundTitle": "Ascension",
    "description": "As Luke and Ben Skywalker pursue the formidable dark-side being Abeloth, the Lost Tribe of the Sith is about to be sundered by an even greater power - which will thrust on Dark Lord into mortal conflict with his own flesh and blood."
  },
  {
    "youtiniTitle": "Balance Point",
    "foundTitle": "Balance Point",
    "description": "As Han Solo and Leia Organa Solo struggle to help the refugees flooding in to the planet Duro from the Rim worlds invaded by the horrific Yuuzhan Vong aliens, Jacen Solo must face a crisis of conscience over how to use the Force as a tool for good while battling the evil invaders who have now set their sights on Duro. 200,000 first printing."
  },
  {
    "youtiniTitle": "Betrayal",
    "foundTitle": "Betrayal: Star Wars Legends (Legacy of the Force)",
    "description": "This is the era of Luke Skywalker’s legacy: the Jedi Master has unified the order into a cohesive group of powerful Jedi Knights. But as the new era begins, planetary interests threaten to disrupt this time of relative peace, and Luke is plagued with visions of an approaching darkness. Evil is rising again–out of the best intentions–and it looks as if the legacy of the Skywalkers may come full circle. Honor and duty will collide with friendship and blood ties as the Skywalker and Solo clans find themselves on opposing sides of an explosive conflict with potentially devastating repercussions for both families, for the Jedi order, and for the entire galaxy. When a mission to uncover an illegal missile factory on the planet Adumar ends in a violent ambush–from which Jedi Knight Jacen Solo and his protégé and cousin, Ben Skywalker, narrowly escape with their lives–it’s the most alarming evidence yet that sparks of political unrest are threatening to ignite into total rebellion. The governments of numerous worlds are chafing under the strict regulations of the Galactic Alliance, and diplomatic efforts to enforce compliance are failing. Fearing the worst, the Alliance readies a preemptive display of military might in a bid to bring the rogue worlds in line before an uprising erupts. The designated target of this exercise: planet Corellia–renowned for the brash independence and renegade spirit that have made its favorite son, Han Solo, a legend. Something of a rogue himself, Jacen is nevertheless duty bound as a Jedi to stand with his uncle, Jedi Master Luke Skywalker, on the side of the Galactic Alliance. But when the wary Corellians launch a counterstrike, the Alliance’s show of force–and a secret mission to disable Corellia’s crucial Centerpoint Station–give way to an armed skirmish. Once the smoke clears, the battle lines are drawn. Now the specter of full-scale war looms between a growing cadre of defiant planets and the Galactic Alliance that some fear is becoming a new Empire. And even as both sides struggle to find a diplomatic solution, mysterious acts of treachery and sabotage threaten peace efforts at every turn. Determined to root out those behind the mayhem, Jacen follows a trail of cryptic clues to a dark rendezvous with the most shocking of revelations . . . while Luke grapples with something even more troubling: dream visions of a shadowy figure whose Force power and ruthlessness remind him of Darth Vader–a lethal enemy who strikes like a dark spirit on a mission of doom. An agent of evil who, if Luke’s visions come to pass, will bring untold pain to the Jedi Master . . . and to the entire galaxy. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Bloodlines",
    "foundTitle": "Bloodlines: Star Wars Legends (Legacy of the Force)",
    "description": "A new era of exciting adventures and shocking revelations continues to unfold, as the legendary Star Wars saga sweeps forward into astonishing new territory. Civil war looms as the fledgling Galactic Alliance confronts a growing number of rebellious worlds–and the approaching war is tearing the Skywalker and Solo families apart. Han and Leia return to Han’s homeworld, Corellia, the heart of the resistance. Their children, Jacen and Jaina, are soldiers in the Galactic Alliance’s campaign to crush the insurgents. Jacen, now a complete master of the Force, has his own plans to bring order to the galaxy. Guided by his Sith mentor, Lumiya, and with Luke’s young son Ben at his side, Jacen embarks on the same path that his grandfather Darth Vader once did. And while Han and Leia watch their only son become a stranger, a secret assassin entangles the couple with a dreaded name from Han’s past: Boba Fett. In the new galactic order, friends and enemies are no longer what they seem. . . . Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Children of the Jedi",
    "foundTitle": "Children of the Jedi",
    "description": "Deactivated for years and drifting aimlessly through space, an old Imperial weapon, a mammoth dreadnought governed by an artificial intelligence, reawakens and sets out on its deadly mission, unless Luke Skywalker, Han Solo, and Princess Leia can stop it. 325,000 first printing. $250,000 ad/promo."
  },
  {
    "youtiniTitle": "Choices of One",
    "foundTitle": "Choices of One",
    "description": "2011 marks the 20th anniversary of the publication of Star Wars: Heir to the Empire by Timothy Zahn, the number 1 New York Times hardcover bestseller that relaunched the entire Star Wars publishing program. To celebrate this historic event, Zahn returns to Star Wars with a brand-new novel of adventure, action, and intrigue starring the young Luke Skywalker, Han Solo, Princess Leia Organa, and the beloved Mara Jade."
  },
  {
    "youtiniTitle": "Clone Wars Gambit: Stealth",
    "foundTitle": "Star Wars: Clone Wars Gambit - Stealth",
    "description": "The first installment of a two-book Obi-Wan Kenobi and Anakin Skywalker adventure, set against the backdrop of the Clone Wars! Obi-Wan Kenobi and Anakin Skywalker are on a secret mission to one of the many worlds caught in the middle of the struggle between the Republic and the Separatists. A pastoral planet, Lanteeb wants only to be left alone to survive -- but it is the source of what could be one of the most devastatingly destructive weapons ever. If this potential weapon were to fall into the hands of the Separatists, uncounted worlds would fall. But should the Republic succeed in destroying it first, one world that needs it to survive will be annihilated. A frightening dilemma that Obi-Wan and Anakin will have to untangle, if they can get in and out of the occupied planet alive..."
  },
  {
    "youtiniTitle": "Coruscant Nights I: Jedi Twilight",
    "foundTitle": "Jedi Twilight: Star Wars Legends (Coruscant Nights, Book I)",
    "description": "With the dark ascension of the Empire, and the Jedi Knights virtually wiped out, one Jedi who escaped the massacre is slated for a date with destiny–and a confrontation with Darth Vader. Jax Pavan is one of the few Jedi Knights who miraculously survived the slaughter that followed Palpatine’s ruthless Order 66. Now, deep in Coruscant’ s Blackpit Slums, Jax ekes out a living as a private investigator, trying to help people in need while concealing his Jedi identity and staying one step ahead of the killers out for Jedi blood. And they’re not the only ones in search of the elusive Jax. Hard-boiled reporter Den Dhur and his buddy, the highly unorthodox droid I-5YQ, have shocking news to bring Jax–about the father he never knew. But when Jax learns that his old Jedi Master has been killed, leaving behind the request that Jax finish a mission critical to the resistance, Jax has no choice but to emerge from hiding–and risk detection by Darth Vader–to fulfill his Master’s dying wish. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Coruscant Nights III: Patterns of Force",
    "foundTitle": "Patterns of Force",
    "description": "The third of three related novels starring Jedi Jax Pavan, droid I-5YQ, and journalist Den Dhur during the time directly after the events of Star Wars: Revenge of the Sith. Jax Pavan is one of the few Jedi Knights who survived the slaughter of Orde"
  },
  {
    "youtiniTitle": "Crosscurrent",
    "foundTitle": "Cross Current",
    "description": "After experiencing an intense Force vision, Jedi Knight Jaden Korr enlists the help of two salvagers and their ship to locate the source of a distress signal in space--a discovery that yields a unimaginable bounty and poses a threat to everything the Jedi Order stands for. Original."
  },
  {
    "youtiniTitle": "Dark Apprentice",
    "foundTitle": "Dark Apprentice",
    "description": "Luke Skywalker finds his academy threatened by untold dangers when his most talented and rebellious student, Kyp Durron, delves dangerously into the Dark Side of the Force, aided by an evil and deadly enemy. Original."
  },
  {
    "youtiniTitle": "Dark Forces: Jedi Knight",
    "foundTitle": "Jedi Knight",
    "description": "Star Wars"
  },
  {
    "youtiniTitle": "Dark Forces: Rebel Agent",
    "foundTitle": "Rebel Agent",
    "description": "The second colorfully illustrated story based on the enormously successful Star Wars CD-ROM games, Dark Forces and Jedi Knight: Dark Forces II, matches Rebel Agent Kyle Katarn against the Dark Jedi, Jerec. Reprint."
  },
  {
    "youtiniTitle": "Dark Forces: Soldier for the Empire",
    "foundTitle": "Star Wars",
    "description": "Kyle Katarn leaves the Imperial Military Academy to join the Rebel Forces after the brutal death of his father, in a Star Wars adventure that combines exciting tale-spinning with superb award-winning artwork. Original."
  },
  {
    "youtiniTitle": "Dark Lord: The Rise of Darth Vader",
    "foundTitle": "Star Wars",
    "description": "Darth Vader, the evil emperor's powerful enforcer, sets out to eliminate all resistance to the Empire, a mission that reveals his true strength and role as the Emperor's iron fist."
  },
  {
    "youtiniTitle": "Darksaber",
    "foundTitle": "Darksaber",
    "description": "A ruthless mining baron joins forces with an Imperial general to construct their own superweapon, while Luke Skywalker and Callista attempt to restore her Jedi powers and Admiral Daala calls for detente among Imperial warlords to launch a new campaign to dominate the galaxy. Reprint."
  },
  {
    "youtiniTitle": "Darth Bane: Dynasty of Evil",
    "foundTitle": "Star Wars: Darth Bane - Dynasty of Evil",
    "description": "The epic tale of Darth Bane--the most famous Sith Lord ever--finds the forcesof evil clashing in a spectacular battle, with the future of the Sith hangingin the balance."
  },
  {
    "youtiniTitle": "Darth Bane: Rule of Two",
    "foundTitle": "Star Wars",
    "description": "When the Sith Wars were over, the Jedi thought the Sith had been destroyed. But one remained: Darth Bane, the most powerful Sith Lord ever. And now, in secret, he is setting out to build his new Sith Order, with which he intends to rule the galaxy, with his new apprentice by his side."
  },
  {
    "youtiniTitle": "Darth Maul: Shadow Hunter",
    "foundTitle": "Darth Maul, Shadow Hunter",
    "description": "Reaves and Bohnhoff deliver a standalone Star Wars adventure thriller set in the time just before \"Star Wars: A New Hope\"--with a title picked by fans and a special guest appearance by Han Solo. Original."
  },
  {
    "youtiniTitle": "Dawn of the Jedi: Into the Void",
    "foundTitle": "Into the Void",
    "description": "A stand-alone hardcover tie-in to the successful comic book series, Star Wars: Dawn of the Jedi, written by fantasy novelist, Tim Lebbon. Taking place thousands of years before the time of Luke Skywalker and Darth Vader. On the remote world Tython ancient philosophers and scientists share their mystical knowledge and study the ways of the Force. They establish the order of the Je'daii--which, in years to come, will become the Jedi. But first these visitors from so many different planets must colonize a dangerous new homeworld and surmount societal conflicts as the burgeoning Rakatan Empire prepares to conquer the known galaxy."
  },
  {
    "youtiniTitle": "Death Troopers",
    "foundTitle": "Death Troopers",
    "description": "A horror tale set in the Star Wars universe follows the harrowing experiences of the crew of an Imperial prison barge that scavenges an abandoned Star Destroyer when their own ship breaks down, a mission after which surviving team members bring back a lethal infection. Reprint. A best-selling book."
  },
  {
    "youtiniTitle": "Edge of Victory I: Conquest",
    "foundTitle": "Star Wars: the New Jedi Order; Edge of Victory I; Conquest"
  },
  {
    "youtiniTitle": "Edge of Victory II: Rebirth",
    "foundTitle": "Star Wars: the New Jedi Order; Edge of Victory II: Rebirth"
  },
  {
    "youtiniTitle": "Empire and Rebellion: Razor's Edge",
    "foundTitle": "Star Wars: Empire and Rebellion: Razor's Edge",
    "description": "Nebula Award finalist Martha Wells makes her Star Wars debut with a brand-new adventure starring Princess Leia and her new friends, Luke Skywalker and Han Solo, in the time just after the destruction of the Death Star in Star Wars: Episode IV: A New Hope. All books in the Empire and Rebellion series are set during the Rebellion era but each can be read as a standalone story. Princess Leia Organa is on a mission for the Rebel Alliance when Imperial forces attack. Now she, Han, and Luke are on their own, working with pirates and dealing with traitors as they race the clock to protect the secrecy of a crucial meeting of Rebel conspirators!"
  },
  {
    "youtiniTitle": "Enemy Lines II: Rebel Stand",
    "foundTitle": "Rebel Stand",
    "description": "While Luke Skywalker's mission to stop the overthrow of the New Republic by the Yuuzhan Vong faces new challenges, Leia and Han Solo become trapped on a small planet whose rulers are about to surrender to their enemies. Original."
  },
  {
    "youtiniTitle": "Force Heretic I: Remnant",
    "foundTitle": "Star Wars: The New Jedi Order - Force Heretic I Remnant",
    "description": "As the bloodied and weary galaxy faces battle once more, the Jedi take on the formidable task of bringing the last of the Empire into the light-From the ashes of the New Republic, torn apart by the Yuuzhan Vong forces, the newly formed Galactic Alliance has risen, determined to bring peace to the entire galaxy. But first the Yuuzhan Vong must be contained once and for all. And so Luke Skywalker seeks a world long lost to legend: Zonama Sekot, a sentient planet believed to have repelled an invasion by the Yuuzhan Vong decades before. Deciphering the enigmatic secrets of Zonama Sekot just might turn the relentless tides of war-"
  },
  {
    "youtiniTitle": "Force Heretic III: Reunion",
    "foundTitle": "Star Wars: The New Jedi Order - Force Heretic III Reunion",
    "description": "The Jedi move one step closer to saving the embattled galaxy-only to confront a formidable wall of resistance.... The harrowing search for Zonama Sekot if finally over for Luke Skywalker, Jacen Solo, and others aboard the Jade Shado. But joy turns to alarm when the living planet sends a defiant message: it refuses to follow them back to a galaxy full of war, exploitation, and misery. While Luke works feverishly to persuade the elusive planet to reconsider, the Yuuzhan Vong launch a full- scale attack aimed at the heart of the new alliance. Sent to defend a major communicating base, Han and Leia find themselves hopelessly outnumbered. Reinforcements are just too far away to help before everything is destroyed. So the courageous pair must now fight an unrelenting battle against staggering odds. Whether they actually survive is another matter...."
  },
  {
    "youtiniTitle": "Fury",
    "foundTitle": "Fury: Star Wars Legends (Legacy of the Force)",
    "description": "Fighting alongside the Corellian rebels, Han and Leia are locked in a war against their son Jacen, who grows more powerful and more dangerous with each passing day. Nothing can stop Jacen’s determination to bring peace with a glorious Galactic Alliance victory–whatever the price. While Luke grieves the loss of his beloved wife and deals with his guilt over killing the wrong person in retaliation, Jaina, Jag, and Zekk hunt for the real assassin, unaware that the culprit commands Sith powers that can cloud their minds and misdirect their attacks–and even turn them back on themselves. As Luke and Ben Skywalker struggle to find their place among the chaos, Jacen, shunned by friends and family, launches an invasion to rescue the only person still loyal to him. But with the battle raging on, and the galaxy growing more turbulent and riotous, there’s no question that it is Jacen who is most wanted: dead or alive. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Han Solo's Revenge",
    "foundTitle": "The Han Solo Adventures",
    "description": "Contains three separate stories about the outer space adventures of Star Wars hero Han Solo and his friend and copilot Chewbacca."
  },
  {
    "youtiniTitle": "Imperial Commando: 501st",
    "foundTitle": "Star Wars: Imperial Commando: 501st",
    "description": "When the Jedi decide to target Count Dooku-Darth Tryanus- himself, they turn to his ex-apprentice, Asajj Ventress, for help in getting close to the slippery Sith Lord. But when unexpected sparks fly between Ventress and Quinlan Vos, the unorthodox Jedi sent to work with her, the mission becomes a web of betrayal, alliances, secrets, and dark plotting that might just be the undoing of both Jedi and Sith - and everything in between!"
  },
  {
    "youtiniTitle": "Inferno",
    "foundTitle": "Inferno",
    "description": "As civil war spreads throughout the galaxy, the Solo/Skywalker clan confronts its own challenges, as Jacen Solo, now a full Sith Lord, seizes control of the Galactic Alliance and Luke Skywalker must decide whether or not to support Jacen or to join the re"
  },
  {
    "youtiniTitle": "Invincible",
    "foundTitle": "Invincible: Star Wars Legends (Legacy of the Force)",
    "description": "No war can last forever. Now, in the long and punishing battle between the defiant champions of the New Jedi Order and the juggernaut that is the Galactic Alliance, the endgame is finally at hand. With so much lost–and nothing less than the course of the future still at stake–there can be no turning back. No matter the consequences. The rebel cause is losing ground under the twin blows of Admiral Gilad Pellaeon’ s assassination and the death of Mara Jade Skywalker. At the same time, having gained the support of the Imperial Remnant and its ruthlessly efficient forces, the Galactic Alliance, with the extraordinary power and dark brilliance of newly ascendant Sith Lord Darth Caedus at its helm, may be unstoppable. Tormented and torn between the call of duty and the thirst for vengeance, Luke has searched the Force and beheld an unspeakable vision of the galaxy enslaved under tyranny more monstrous than even Palpatine’s. Now it seems that the last, best hope lies in mobilizing the scattered Jedi for one decisive search-and-destroy mission. The objective: eliminate Darth Caedus. It’s a plan that will be as difficult and dangerous to execute as it is daring. For Caedus is a scion of both the Skywalker and Solo bloodlines whose command of the Force surpasses even that of his grandfather Darth Vader. There is only one who is bound by destiny to stand against him in what will surely be a duel to the death, only one with an outside chance of bringing down the dark lord who was once Jacen Solo. Failure is not an option. The furious final moments between power and peace are here, and whoever confronts Darth Caedus will decide the outcome–and the fate of those left standing. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Jedi Search",
    "foundTitle": "Jedi Search: Star Wars Legends (The Jedi Academy)",
    "description": "As the war between the Republic and the scattered remnants of the Empire continues, two children--the Jedi twins--will come into their powers in a universe on the brink of vast changes and challenges. In this time of turmoil and discovery, an extraordinary new Star Wars saga begins.... While Luke Skywalker takes the first step toward setting up an academy to train a new order of Jedi Knights, Han Solo and Chewbacca are taken prisoner on the planet Kessel and forced to work in the fathomless depths of a spice mine. But when Hans and Chewie break away, they flee desperately to a secret imperial research laboratory surrounded by a cluster of black holes--and go from one danger to a far greater one.... On Kessel, Luke picks up the trail of his two friends, only to come face to face with a weapon so awesome, it can wipe out an entire solar system. It is a death ship called the Sun Crusher, invented by a reclusive genius and piloted by none other than Han himself... Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Kenobi",
    "foundTitle": "Star Wars: Kenobi",
    "description": "The greatest hero in the galaxy faces his toughest challenge yet: He must stop being Obi-Wan -- and become Crazy Old Ben. For fans of movie-related novels like Darth Plagueis! In this original novel set between the events of Star Wars: Episode III Revenge of the Sith and Episode IV A New Hope, Obi-Wan Kenobi comes to the aid of the residents of Tatooine during his exile. But he struggles with his new mission when he realizes that protecting Luke Skywalker--the last hope of the galaxy--means setting aside his compassion and his Jedi warrior training, for the future of the galaxy lies not with Obi-Wan Kenobi, but with a mystical desert recluse known only by the name of Crazy Old Ben."
  },
  {
    "youtiniTitle": "Knight Errant",
    "foundTitle": "Star Wars",
    "description": "A lone Jedi in Sith space dedicates her life to bringing down Sith rule, one act of sabotage at a time. A thousand years before Star Wars: A New Hope, the Republic is in a dark age and groups of Sith have taken over vast swaths of the galaxy. Hiding in one Sith hell-hole is Kerra Holt, a young Jedi working alone to destroy the Sith Masters. But what she doesn't know is that she just might be the pawn of a powerful Sith Lord..."
  },
  {
    "youtiniTitle": "Lando Calrissian and the Flamewind of Oseon",
    "foundTitle": "Lando Calrissian and the Flamewind of Oseon",
    "description": "On a gambling trip to Oseon, the wealthy resort star system, Lando discovers that accidents that nearly destroyed his ship were actually murder attempts by an unknown enemy"
  },
  {
    "youtiniTitle": "Lando Calrissian and the Mindharp of Sharu",
    "foundTitle": "Lando Calrissian and the Mindharp of Sharu"
  },
  {
    "youtiniTitle": "Lando Calrissian and the Starcave of ThonBoka",
    "foundTitle": "Lando Calrissian and the Starcave of ThonBoka",
    "description": "Lando Calrissian - gambler, rogue and con artist. Lando goes out on a limb to help a race of persecuted aliens and finds himself up against several sets of his own enemies."
  },
  {
    "youtiniTitle": "Lost Tribe of the Sith: The Collected Stories",
    "foundTitle": "Star Wars Lost Tribe of the Sith: the Collected Stories",
    "description": "\"This collection of stories tells the origin of that tribe. It includes all eight of the Lost tribe of the Sith stories, as well as Pandemonium, the final chapter.\"--Publisher description."
  },
  {
    "youtiniTitle": "Luke Skywalker and the Shadows of Mindor",
    "foundTitle": "Luke Skywalker and the Shadows of Mindor",
    "description": "When Luke Skywalker and his companions are lured to Mindor and into an epic battle with Lord Shadowspawn's Black Stormtroopers, they are unaware that the entire confrontation is part of a diabolical plot by Lord Shadowspawn, a would-be Emperor of the galaxy. Reprint."
  },
  {
    "youtiniTitle": "MedStar II: Jedi Healer",
    "foundTitle": "Jedi Healer",
    "description": "An embattled medical unit in the steamy Jasserak jungle is confronted by overwhelming odds as Republic forces battle the Separatists and the members of the team take a risk that could be their only chance of survival."
  },
  {
    "youtiniTitle": "Millennium Falcon",
    "foundTitle": "Star Wars",
    "description": "After their granddaughter Allana Solo discovers a strange device aboard the Millenium Falcon, Han and Leia begin an investigation into the space ship's past owners and battles to find out the significance of the artifact."
  },
  {
    "youtiniTitle": "Order 66: A Republic Commando Novel",
    "foundTitle": "Order 66: Star Wars Legends (Republic Commando)",
    "description": "After the fierce combat of Hard Contact, Triple Zero, and True Colors comes the spectacular culmination of New York Times bestselling author Karen Traviss’s gripping Republic Commando series. As a battle-scarred era nears its end, a shattering power play is about to stun the entire galaxy . . . and set in motion events that will alter destinies and resound throughout history. Even as the Clone Wars are about to reach an explosive climax, no one knows if victory will favor the Grand Army of the Republic (GAR) or the Separatists. But no matter who wins, the stakes are highest for elite Special Ops clones like the Republic Commandos in Omega and Delta squads–and the notorious renegade Advance Recon Commando troopers known as Null ARCs. With Republic forces stretched to the max and casualties mounting, the last thing these beleaguered warriors need to hear is that Chancellor Palpatine is keeping vast armies of secret clone troops in reserve. Sergeant Skirata, a mentor to the clone commandos, has no intention of standing idly by while Palpatine sends them into battle like lambs to the slaughter. Skirata begins to plan the clones’ escape from the GAR, but his heroic effort will be in vain unless he can reverse the clones’ accelerated aging process. Caught in the treacherous dealings of their leaders, and locked in the battles of their lives, the disillusioned Null ARCs and Commandos nonetheless fight with everything they’ve got, determined to wrest victory from the Seps and save the galaxy. But even the deadliest weapons may not be powerful enough to defeat the real menace. And nothing will stop the apocalyptic horror unleashed when Palpatine utters the chilling words The time has come. Execute Order 66. Translation: The Jedi have tried to stage a coup, and all must be shot on sight. With their faith in the Republic and their loyalty to their Jedi allies put to the ultimate test, how will the men of Omega and Delta squads react to the most infamous command in galactic history? All the breathtaking action, suspense, and intrigue of Karen Traviss’s Republic Commando series comes alive in Star Wars: Order 66. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Outbound Flight",
    "foundTitle": "Star Wars",
    "description": "Before the onset of the Clone Wars, a group of explorers consisting of six Jedi Masters, twelve Jedi Knights, and a fifty-thousand-member crew sets out aboard a state-of-the-art starship on a mission to search for intelligent life outside the known galaxy, in an account of the Outbound Flight Project and of the first encounter with the alien warlord Thrawn. 70,000 first printing."
  },
  {
    "youtiniTitle": "Outcast",
    "foundTitle": "Outcast",
    "description": "Han Solo, Luke Skywalker, Leia Organa Solo, and their surviving children set off on a journey of discovery and hardship, obstacles and victories, in the aftermath of the civil war that rocked the galaxy."
  },
  {
    "youtiniTitle": "Planet of Twilight",
    "foundTitle": "Planet of Twilight",
    "description": "As Han Solo and Chewbacca search the barren, backwater world of Nam Chorios for Princess Leia, who has been taken captive by a ruthless warlord, a bizarre life form emerges that is bent on the destruction of the New Republic. Reprint."
  },
  {
    "youtiniTitle": "Rebel Dawn",
    "foundTitle": "Rebel Dawn",
    "description": "The third volume in an exciting trilogy that began with The Paradise Snare, this explosive story describes how Han Solo won the Millennium Falcon, the fastest ship in the galaxy, and how he ended up at Mos Eisley in Chalmun's Cantina. Original."
  },
  {
    "youtiniTitle": "Red Harvest",
    "foundTitle": "Star Wars",
    "description": "In a zombie horror tale set in the Star Wars universe, the Sith academy apprentices react fearfully to new outbreaks of unexplained violence, the Dark Lord's withdrawal, and a Jedi Master's efforts to rescue a hostage."
  },
  {
    "youtiniTitle": "Republic Commando: Hard Contact",
    "foundTitle": "Hard Contact: Star Wars Legends (Republic Commando)",
    "description": "As the Clone Wars rage, victory or defeat lies in the hands of elite squads that take on the toughest assignments in the galaxy–stone-cold soldiers who go where no one else would, to do what no one else could. . . . On a mission to sabotage a chemical weapon research facility on a Separatist-held planet, four clone troopers operate under the very noses of their enemies. The commandos are outnumbered and outgunned, deep behind enemy lines with no backup–and working with strangers instead of trusted teammates. Matters don’t improve when Darman, the squad’s demolitions expert, gets separated from the others during planetfall. Even Darman’s apparent good luck in meeting an inexperienced Padawan vanishes once Etain admits to her woeful inexperience. For the separated clone commandos and stranded Jedi, a long, dangerous journey lies ahead, through hostile territory brimming with Trandoshan slavers, Separatists, and suspicious natives. A single misstep could mean discovery . . . and death. It’s a virtual suicide mission for anyone–anyone except Republic Commandos. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Republic Commando: Triple Zero",
    "foundTitle": "Triple Zero",
    "description": "Star Wars Republic Commando: Triple Zero - the sequel to Star Wars Republic Commando: Hard Contact - is set a year after the battle of Geonosis, and follows the continuing missions of Omega Squad. As the Clone Wars casualties mount, the commandos find themselves deployed on increasingly dangerous missions that take them beyond the battlefield and further into sabotage and intelligence operations in the heart of Separatist territory. Newly-promoted Jedi Generals Etain Tur-Mukan and Bardan Jusik are also catapulted into front line combat roles and find themselves identifying strongly with the clone soldiers under their command, who turn out to be anything but predictable cannon fodder. Then Omega Squad survives a close brush with disaster to end up in the most potentially dangerous hot spot in the galaxy."
  },
  {
    "youtiniTitle": "Riptide",
    "foundTitle": "Star Wars: Riptide",
    "description": "In the process of vanquishing a shipload of Sith from the distant past, Jedi Knight Jaden Korr uncovered the frozen results of a horrific cloning experiment: insane Jedi-Sith clones. Only some of those clones thawed...and now they're loose in a galaxy that has enough to deal with under the tightening grip of the evil Darth Caedus. Jaden Korr will have to hunt them down, and if he can't save them, he will have to destroy them!"
  },
  {
    "youtiniTitle": "Rogue Planet",
    "foundTitle": "Rogue Planet",
    "description": "You've seen the movie The Phantom Menace. You've read the #1 New York Times best-selling book based on George Lucas's masterpiece. Now, before the eagerly awaited release of Episode II, comes a stunning new Star Wars novel, from one of science fiction's greatest talents, Greg Bear. Rogue Planet is an unforgettable journey stretching from the farthest reaches of known space to the battlefield of a young boy's heart, where a secret struggle is being waged that will decide the fate of billions. That boy is twelve-year-old Anakin Skywalker. The Force is strong in Anakin so strong that the Jedi Council, despite misgivings, entrusted the young Jedi Knight Obi-Wan Kenobi with the mission of training him to become a Jedi Knight. Obi-Wan - like his slain Master, Qui-Gon - believes Anakin may be the chosen one, the Jedi destined to bring balance to the Force. But first Obi-Wan must help his undisciplined, idealistic apprentice, who still bears the scars of slavery, find his own balance. Dispatched to the mysterious planet Zonama Sekot, source of the fastest ships in the galaxy, Obi-Wan and Anakin are swept up in a swirl of deadly intrigue and betrayal. For there are others who covet the power such superfast ships could bring. Raith Siener, a brilliant but unscrupulous weapons and ship designer, has the brains to decipher the Zonama Sekot ship design. Commander Wilhuff Tarkin has at his"
  },
  {
    "youtiniTitle": "Sacrifice",
    "foundTitle": "Star Wars: Legacy of the Force V - Sacrifice",
    "description": "SACRIFICE is the fifth book in the 9-book Legacy of the Force series, a bold new Star Wars story arc for fans of the New Jedi Order and the franchise's most popular characters: Luke, Han, and Leia. This is the middle book in the series and the second of three hardcovers. The adventure continues, and one of our storylines comes to a crucial and shocking climax. Things come to a head in the galaxy of the Skywalker and Solos when Jacen Solo makes a horrifying decision from which there is no going back. For Luke, Han and Leia, nothing will ever be the same again..."
  },
  {
    "youtiniTitle": "Scoundrels",
    "foundTitle": "Scoundrels: Star Wars Legends",
    "description": "Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years! To make his biggest score, Han’s ready to take even bigger risks. But even he can’t do this job solo. NEW YORK TIMES BESTSELLER Han Solo should be basking in his moment of glory. After all, the cocky smuggler and captain of the Millennium Falcon just played a key role in the daring raid that destroyed the Death Star and landed the first serious blow to the Empire in its war against the Rebel Alliance. But after losing the reward his heroics earned him, Han’s got nothing to celebrate. Especially since he’s deep in debt to the ruthless crime lord Jabba the Hutt. There’s a bounty on Han’s head—and if he can’t cough up the credits, he’ll surely pay with his hide. The only thing that can save him is a king’s ransom. Or maybe a gangster’s fortune? That’s what a mysterious stranger is offering in exchange for Han’s less-than-legal help with a riskier-than-usual caper. The payoff will be more than enough for Han to settle up with Jabba—and ensure he never has to haggle with the Hutts again. All he has to do is infiltrate the ultra-fortified stronghold of a Black Sun crime syndicate underboss and crack the galaxy’s most notoriously impregnable safe. It sounds like a job for miracle workers . . . or madmen. So Han assembles a gallery of rogues who are a little of both—including his indispensable sidekick Chewbecca and the cunning Lando Calrissian. If anyone can dodge, deceive, and defeat heavily armed thugs, killer droids, and Imperial agents alike—and pull off the heist of the century—it’s Solo’s scoundrels. But will their crime really pay, or will it cost them the ultimate price? BONUS: Includes the novella Winner Lose All. Praise for Scoundrels “Rapid-fire adventure [that] adds yet another dimension of enjoyment to a rousing galactic romp.”—Library Journal “Highly entertaining . . . excellent Star Wars . . . There are many twists and turns [and] Zahn manages to find ways to twist them one step further than you’d expect.”—Examiner.com “[Scoundrels] brings freshness to the franchise.”—USA Today"
  },
  {
    "youtiniTitle": "Shadow Games",
    "foundTitle": "Star Wars",
    "description": "When he agrees to be the bodyguard of Javul Charn--the most famous pop star in the galaxy and the runaway bride of a violent lieutenant in Black Sun-- Dash Rendar, broke and desperate, must discover who is trying to sabotage Javul's tour and finds an unexpected ally in Han Solo. Original."
  },
  {
    "youtiniTitle": "Shatterpoint",
    "foundTitle": "Star Wars: Shatterpoint"
  },
  {
    "youtiniTitle": "Showdown at Centerpoint",
    "foundTitle": "Showdown at Centerpoint: Star Wars Legends (The Corellian Trilogy)",
    "description": "In this third and final volume of the Corellian trilogy, Han and Luke lead the Alliance in a mad scramble against the Selonian rebels for control of the planetary technology. When a loyalist ship approaching Selonia is blasted out of space, Han Solo quickly realizes that rebel forces are turning planetary repulsors into weapons of immense destruction. Meanwhile, Luke Skywalker and Lando Calrissian manage to discover the terrifying secret of Centerpoint Station. It is the infamous Starbuster itself, and its next programmed nova, hard-wired in, is set to annihilate a chosen star, its inhabited worlds, and millions of innocent lives. There's only one way to stop it: blow up the station. But as a massive rebel fleet closes in on Centerpoint, Han, Luke, and their friends will discover time is running out. Then the true leaders of the rebellion reveal their identities and issue their final ultimatum: The New Republic must withdraw all claim to power over the entire Corellian sector. With the future of Corellian freedom at stake, Han and those loyal to the Republic must somehow resist. But how can they possibly stop the deadliest weapon the galaxy has ever known? Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Slave Ship",
    "foundTitle": "Slave Ship: Star Wars Legends (The Bounty Hunter Wars)",
    "description": "He's both feared and admired, respected and despised. Boba Fett is the galaxy's most successful bounty hunter. Now he finds himself the hunted in the oldest game of all: survival of the fittest. The once powerful Bounty Hunter's Guild has been shattered into warring factions. Now the posting of an enormous bounty on a renegade Imperial stormtrooper is about to start a frenzy of murderous greed. Hoping to fuel rumors of his death, Boba Fett abandons his ship, Slave I, and sets out to claim the prize. Yet his every move leads him closer to a trap set by the cunning Prince Xizor. Fett will die before becoming Xizor's pawn in the Emperor's war against the Rebels. And he may have to. For in order to gain his freedom he must outwit a sentient weapon that feeds on human spirits. Then he must escape a galaxy of deadly enemies who want to make the rumors of his death a reality. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Specter of the Past",
    "foundTitle": "Specter of the Past",
    "description": "In the first half of a two-volume story, the New Republic's efforts to forge peace with the Empire is thwarted by a cabal of warlords led by the notorious, and reputedly dead, Grand Admiral Thrawn. Reprint."
  },
  {
    "youtiniTitle": "Star by Star",
    "foundTitle": "Star by Star: Star Wars Legends",
    "description": "The New York Times bestselling Star Wars series The New Jedi Order enthralls readers with its epic drama and thrilling adventure. Now readers will pierce the very heart of darkness. . . . It is a solemn time for the New Republic, as the merciless Yuuzhan Vong continue their campaign of destruction. The brutal enemy has unleashed a savage creature capable of finding—and killing—Jedi Knights. And now Leia Organa Solo faces a terrible ultimatum. If the location of the secret Jedi base is not revealed within one week, the Yuuzhan Vong will blast millions of refugee ships into oblivion. As the battered but still unbroken Jedi scramble to deal with the newest onslaught, Leia’s son Anakin lays out a daring plan. He will lead a Jedi strike force into the heart of enemy territory in order to sabotage the Yuuzhan Vong’s deadliest weapons. There, with his brother and sister at his side, he will come face-to-face with his destiny—as the New Republic, still fighting the good fight, will come face-to-face with theirs. . . . Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Star Wars Episode I: The Phantom Menace",
    "foundTitle": "Star Wars",
    "description": "Two Jedi peace ambassadors are sent to investigate the Trade Federation blockade of Naboo and later meet Anakin Skywalker, a young slave living on Tatooine, whom they believe to be a good candidate for Jedi training"
  },
  {
    "youtiniTitle": "Star Wars Insider: The Fiction Collection: Volume #1",
    "foundTitle": "Star Wars Insider: Fiction Collection Vol. 1",
    "description": "The official magazine of the Star Wars saga presents an amazing collection of exclusive fully-illustrated short stories from the galaxy far, far away. Including tales starring iconic characters such as Han Solo, Lando Calrissian and Darth Vader, this collection also features stories showcasing supporting characters such as Darth Plagueis, Cad Bane, and Temmin “Snap” Wexley. Includes fiction written by renowned best-selling Star Wars authors such as Jason Fry, Matthew Stover, Timothy Zahn, John Ostrander, and Christie Golden, this volume also includes stunning art from some of the saga’s best-loved interpreters, including Joe Corroney, Brian Rood, Jan Duursema, and John Van Fleet. Stories included: “Vader Adrift” Author: Ryder Windham Artist: Joe Corroney “First Blood” Author: Christie Colden Artist: Brian Rood “Buyer’s Market” Author: Timothy Zahn Artist: Brian Rood “And Leebo Makes Three” Author: Michael Reaves and Maya Kaathryn Bohnoff Artist: Greg and Tim Hildebrandt “A Fair Trade” Author: Christie Golden Artist: Joe Corroney “The Teneborus Way” Author: Matthew Stover Artist: Brian Rood “Maze Run” Author: David J. Williams and Mark S. Williams Artist: Brian Rood “The Guns of Kelrodo-Ai” Author: Jason Fry Artist: John Van Fleet “Hunting the Gorach” Author: Jeff Grubb Artist: Joe Corroney “Getaway” Author: Christie Golden Artist: Joe Corroney “Roll of the Dice” Author: Karen Miller Artist: David Rabbitte “Reputation” Author: Ari Marmell Artist: Tom Hodges “Eruption” Author: John Ostrander Artist: Jan Duursema “One Thousand Levels Down” Author: Alexander Freed Artist: Joe Corroney and Brian Miller “Orientation” Author: John Jackson Miller Artist: Brian Rood “Blade Squadron (Part One)” Author: David J. Williams and Mark S. Williams Artist: Chris Trevas “Blade Squadron (Part Two)” Author: David J. Williams and Mark S. Williams Artist: Chris Trevas “Blade Squadron: Zero Hour” Author: David J. Williams and Mark S. Williams Artist: Chris Trevas “Blade Squadron: Kuat” Author: David J. Williams and Mark S. Williams Artist: Chris Trevas “Blade Squadron: Jakku” Author: David J. Williams and Mark S. Williams Artist: Chris Trevas"
  },
  {
    "youtiniTitle": "Tales from the New Republic",
    "foundTitle": "Star Wars Omnibus",
    "description": "Collects Star Wars: Droids Special #1, Star Wars: Droids - The Kalarba Adventures #1-6, Star Wars: Droids - Artoo's Day Out #1, Star Wars: Droids - Rebellion #1-4, Star Wars: Droids - Season of Revolt #1-4, Star Wars: Droids - The Protocol Offensive #1. Before the clueless C-3PO and his clever companion R2-D2 fell into the sands of Tatooine for their first fateful meeting with Luke Skywalker, those two troublesome droids had some amazing adventures all their own! Sold to a junk trader and shipped off to the treacherous Kalarba system, Artoo and Threepio begin a journey that takes them from the jaws of a droid-eating beast to the frontlines of a revolution! Entagled with pirates, bounty hunters, and the notorious space criminal Olag Greck, they do their best to stick together in a dangerous galaxy where anything can happen!"
  },
  {
    "youtiniTitle": "The Cestus Deception",
    "foundTitle": "The Cestus Deception",
    "description": "Dispatched by the Republic to the planet Ord Cestus, where deadly battle droids are being manufactured, Obi-Wan Kenobi finds his diplomatic efforts to keep the droids out of Confederacy hands thwarted by a secret adversary, a situation that forces him to team up with a clone soldier. Reprint."
  },
  {
    "youtiniTitle": "The Force Unleashed",
    "foundTitle": "The Force Unleashed: Star Wars Legends",
    "description": "“The Sith always betray one another. . . . I’m sure you’ll learn that soon enough.” The overthrow of the Republic is complete. The Separatist forces have been smashed, the Jedi Council nearly decimated, and the rest of the Order all but destroyed. Now absolute power rests in the iron fist of Darth Sidious–the cunning Sith lord better known as the former Senator, now Emperor, Palpatine. But more remains to be done. Pockets of resistance in the galaxy must still be defeated and missing Jedi accounted for . . . and dealt with. These crucial tasks fall to the Emperor’s ruthless enforcer, Darth Vader. In turn, the Dark Lord has groomed a lethal apprentice entrusted with a top-secret mission: to comb the galaxy and dispatch the last of his masters’ enemies, thereby punctuating the dark side’s victory with the Jedi’s doom. Since childhood, Vader’s nameless agent has known only the cold, mercenary creed of the Sith. His past is a void; his present, the carrying out of his deadly orders. But his future beckons like a glistening black jewel with the ultimate promise: to stand beside the only father he has ever known, with the galaxy at their feet. It is a destiny he can realize only by rising to the greatest challenge of his discipleship: destroying Emperor Palpatine. The apprentice’s journeys will take him across the far reaches of the galaxy, from the Wookiee homeworld of Kashyyyk to the junkyard planet of Raxus Prime. On these missions, the young Sith acolyte will forge an unlikely alliance with a ruined Jedi Master seeking redemption and wrestle with forbidden feelings for his beautiful comrade, Juno Eclipse. And he will be tested as never before–by shattering revelations that strike at the very heart of all he believes and stir within him long-forgotten hopes of reclaiming his name . . . and changing his destiny. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "The Force Unleashed II",
    "foundTitle": "The Force Unleashed II: Star Wars Legends",
    "description": "As ruthless apprentice to Darth Vader, Starkiller was mercilessly schooled in the ways of the dark side, commanded to exterminate the last of the purged Jedi Order, and groomed for the ultimate Sith power play: assassination of the Emperor. He served without question, killed without remorse, and lost his heart without warning to beautiful Imperial fighter pilot Juno Eclipse, never suspecting that he was just a tool in the schemes of his masters—until it was too late to escape their lethal betrayal. Juno mourned Starkiller as dead...but now he is back, purged of all memories and programmed to kill. And as fate brings Juno and Starkiller closer to reuniting, with Darth Vader determined not to lose his assassin a second time, they will both have to make a stand. The prize is freedom. The punishment for failing will be eternal enslavement to the dark side of the Force... Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "The Han Solo Adventures",
    "foundTitle": "The Han Solo Adventures",
    "description": "In three adventures, Han Solo searches for a missing ship rebuilder, frees an illegal consignment of slaves, and finds a planet of fabled riches"
  },
  {
    "youtiniTitle": "The Last Command",
    "foundTitle": "The Last Command: Star Wars Legends (The Thrawn Trilogy)",
    "description": "The epic story that began with Heir to the Empire reaches its dramatic conclusion in this essential Star Wars Legends novel. The embattled Republic reels from the attacks of Grand Admiral Thrawn, who has marshaled the remnants of the Imperial forces and driven the Rebels back with an abominable technology recovered from the Emperor's secret fortress: clone soldiers. As Thrawn mounts his final siege, Han Solo and Chewbacca struggle to form a coalition of smugglers for a last-ditch attack, while Princess Leia holds the Alliance together and prepares for the birth of her Jedi twins. The Republic has one last hope—sending a small force into the very stronghold that houses Thrawn’s terrible cloning machines. There a final danger awaits, as the Dark Jedi C’baoth directs the battle against the Rebels and builds his strength to finish what he already started: the destruction of Luke Skywalker."
  },
  {
    "youtiniTitle": "The Last Jedi",
    "foundTitle": "The Last Jedi: Star Wars Legends",
    "description": "Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years! KNIGHT OF RECKONING The Emperor’s ruthless Order 66 has all but exterminated the Jedi. The few remaining who still wield the Force for good have been driven into exile or hiding. But not Jax Pavan, who’s been steadily striking blows against the Empire—as a lone guerrilla fighter and a valued partner of Whiplash, a secret Coruscant-based resistance group. Now he’s taking on his most critical mission: transporting a valued Whiplash leader, targeted for assassination, from Coruscant to safety on a distant world. It’s a risky move under any circumstances, but Jax and his trusted crew aboard the Far Ranger, including the irrepressible droid I-Five, are prepared to pit their combat skills and their vessel’s firepower against all Imperial threats—except the one Jax fears most. Reports have raced across the galaxy that the dark lord of the Sith has fallen in a duel to the death with a Rebel freedom fighter. But Jax discovers the chilling truth when he reaches out with the Force . . . only to touch the dark, unmistakable, and malignantly alive presence that is Darth Vader. And Jax knows that Vader will stop at nothing until the last Jedi has fallen."
  },
  {
    "youtiniTitle": "The New Rebellion",
    "foundTitle": "The New Rebellion",
    "description": "When the New Republic is threatened by a secret plot, Luke, Leia, and Han Solo must try to stop the evil master of the dark side, who will stop at nothing to become emperor, before they face the ultimate destruction of their galaxy. Reprint."
  },
  {
    "youtiniTitle": "The Old Republic: Annihilation",
    "foundTitle": "Annihilation: Star Wars Legends (The Old Republic)",
    "description": "Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years! Based on the epic videogame from BioWare and LucasArts NEW YORK TIMES BESTSELLER The Sith Empire is in flux. The Emperor is missing, presumed dead, and an ambitious Sith lord’s attempt to seize the throne has ended fatally. Still, Darth Karrid, commander of the fearsome Imperial battle cruiser Ascendant Spear, continues her relentless efforts to achieve total Sith domination of the galaxy. But Karrid’s ruthless determination is more than matched in the steely resolve of Theron Shan, whose unfinished business with the Empire could change the course of the war for good. Though the son of a Jedi master, Theron does not wield the Force—but like his renowned mother, the spirit of rebellion is in his blood. As a top covert agent for the Republic, he struck a crucial blow against the Empire by exposing and destroying a Sith superweapon arsenal—which makes him the ideal operative for a daring and dangerous mission to end Ascendant Spear’s reign of terror. Joined by hot-headed smuggler Teff’ith, with whom he has an inexplicable bond, and wise Jedi warrior Gnost-Dural, Darth Karrid’s former master, Theron must match wits and weapons with a battle-tested crew of the most cold-blooded dark side disciples. But time is brutally short. And if they don’t seize their one chance to succeed, they will surely have countless opportunities to die. Praise for Annihilation “An espionage story interwoven with personal conflicts . . . space battles, lightsaber fights, and gripping spy missions . . . Annihilation may be Karpyshyn’s strongest novel yet.”—Roqoo Depot “Pure Star Wars action-adventure entertainment as only Drew Karpyshyn can write it.”—The Founding Fields"
  },
  {
    "youtiniTitle": "The Old Republic: Fatal Alliance",
    "foundTitle": "Fatal Alliance",
    "description": "A smuggler's discovery of a rich treasure sparks a competition involving the Republic, the Empire, the Hutts, and the Jedi High Council, all of whom are manipulated by an enigmatic spy."
  },
  {
    "youtiniTitle": "The Old Republic: Revan",
    "foundTitle": "STAR WARS - REVAN",
    "description": "Revan, a former Jedi whose memories have been erased, believes that he somehow stumbled on a secret that threatens the existence of the Republic and must try to stop it, even though he no longer knows what it is."
  },
  {
    "youtiniTitle": "The Paradise Snare",
    "foundTitle": "The Paradise Snare",
    "description": "Recounts the early years of the young Han Solo, beginning with his late teenage years, as he chafes under the sadistic tyranny of the cruel Garris Shrike, and chronicling his transformation into a swashbuckling pilot, smuggler, and rogue. Original."
  },
  {
    "youtiniTitle": "The Truce at Bakura",
    "foundTitle": "The Truce at Bakura: Star Wars Legends",
    "description": "No sooner has Darth Vader's funeral pyre burned to ashes on Endor than the Alliance intercepts a call for help from a far-flung Imperial outpost. Bakura is on the edge of known space and the first to meet the Ssi-ruuk, cold-blooded reptilian invaders who, once allied with the now dead Emperor, are approaching Imperial space with only one goal; total domination. Princess Leia sees the mission as an opportunity to achieve a diplomatic victory for the Alliance. But it assumes even greater importance when a vision of Obi-Wan Kenobi appears to Luke Skywalker with the message that he must go to Bakura-or risk losing everything the Rebels have fought so desperately to achieve. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "The Unifying Force",
    "foundTitle": "The Unifying Force",
    "description": "Luke, Mara, and Jacen fight a losing battle against the Yuuzhan Vong and vanish into unknown space, while the resistance prepares for an ultimate showdown."
  },
  {
    "youtiniTitle": "The Unseen Queen",
    "foundTitle": "The Unseen Queen: Star Wars Legends (Dark Nest, Book II)",
    "description": "The epic Star Wars odyssey enters a new frontier as the heroes of the New Jedi Order confront a monstrous evil–insidious, unseen, and insatiable. . . . Despite being given new worlds to populate, the insectoid Killiks have not found peace. An unknown enemy has been attacking the new nests–and the Killiks hold the Jedi responsible. Traveling back to the Unknown Regions to unravel the mystery, the Skywalkers and Solos discover an evil far more familiar than they ever expected . . . and even more terrifying. Why does the Dark Nest want to kill Mara? Will Jacen’s apocalyptic vision trigger another galactic war or prevent one? And perhaps most ominous of all, what deadly secret are the Killiks hiding? To find out, Luke, Mara, Han, and Leia must embark on a perilous journey into the uncharted void between right and wrong. The ferocious Unknown Terrors are only the beginning of the awesome challenges that lie ahead in their quest to fathom the unfathomable. For an obscure dispute is about to explode into chaos, pitting Jedi against Jedi–and threatening the very galaxy itself. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Traitor",
    "foundTitle": "Traitor: Star Wars Legends",
    "description": "From the depths of catastrophe, a glimmer of hope After the capture of Coruscant, the mighty heart of the New Republic, a stunned galaxy fears that nothing can stop the Yuuzhan Vong. Still, that crushing defeat produces one small miracle: Jacen Solo is alive. Yet he can scarcely imagine himself in stranger circumstances. The young Jedi Knight is in the care of Vergere, a fascinating creature of mystery and power, her intentions hard to fathom, her cruelties rarely concealed. But this master of inscrutable arts has much to teach the young Jedi . . . for she holds the key to a new way to experience the Force, to take it to another level—dangerous, dazzling, perhaps deadly. In the wrong hands, the tremendous energies of the Force can be devastating. And there are others watching Jacen’s process closely, waiting patiently for the moment when he will be ready for their own dire purposes. Now, all is in shadows. Yet whatever happens, whether Jacen’s newfound mastery unleashes light or darkness, he will never be the same Jedi again. . . . Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Vector Prime",
    "foundTitle": "Star Wars the New Jedi Order",
    "description": "Presents the adventures of Luke Skywalker in three stories, \"Vector Prime,\" \"Onslaught,\" and \"Ruin.\""
  },
  {
    "youtiniTitle": "Vortex",
    "foundTitle": "Vortex",
    "description": "Teaming up with precarious Sith allies to learn the origins of a mysterious Force-entity, the Skywalkers uncover dangerous secrets about a powerful group that has the ability to influence the Jedi order's future. Reprint."
  },
  {
    "youtiniTitle": "X-Wing: Isard's Revenge",
    "foundTitle": "Isard's Revenge"
  },
  {
    "youtiniTitle": "X-Wing: Rogue Squadron",
    "foundTitle": "Rogue Squadron",
    "description": "Henry is generally well-behaved, but he is occasionally arrogant and vain. Henry is at heart a hard worker, but his frequent bouts of illness hinder his work."
  },
  {
    "youtiniTitle": "X-Wing: Solo Command",
    "foundTitle": "Solo Command: Star Wars Legends (X-Wing)",
    "description": "Wraith Squadron: they are the Rebel Alliance's ultimate strike force. Sleek, swift, and deadly, they are the first in battle, the last line of defense. Now they must find and destroy a wily enemy more powerful than the Empire itself. Their covert mission has been a success. The enemy has been vanquished. Or so they thought. The Super Star Destroyer Iron Fist somehow escaped destruction and with it the New Republic's greatest threat, the infamous warlord Zsinj. To defeat him, Wraith Squadron must join a combat task force led by the only man crafty enough to beat Zsinj at his own game: Han Solo. But Zsinj knows the X-wing fighters' indomitable courage is both their greatest strength--and their greatest weakness. For even against the most overwhelming odds, the Rebels will fight to the death. And that will leave Zsinj the galaxy's unchallenged master! Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "X-Wing: Starfighters of Adumar",
    "foundTitle": "Starfighters of Adumar: Star Wars Legends (X-Wing)",
    "description": "Book 9 in the exciting series! The X-wing fighter pilots have earned their reputation as the Rebel Alliance's ultimate strike force by overwhelming enemies with their rapid-fire assaults. But now they are about to embark on a diplomatic mission that will prove to be even more hazardous than all-out combat.... The neutral world of Adumar has decided to pick a side in the war to control the galaxy. Delegates from both the New Republic and the Empire have been invited to Adumar, and each camp will be given a chance to plead its government's case. But there is one small catch: since the Adumari prize military skill above all else, they insist that both delegations be composed exclusively of fighter pilots. For pilot Wedge Antilles and his company, it's an unfamiliar exercise in diplomacy--and one that's filled with unexpected peril. For once they arrive, the X-wing pilots are challenged by Adumar's fierce warriors and attacked by Imperial assassins bent on eliminating all competition. But these challenges pale in comparison to the threat posed by a rogue Republic agent...one who is determined to win Adumar's allegiance once and for all--even if it costs the X-wing pilots their lives. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "X-Wing: The Krytos Trap",
    "foundTitle": "The Krytos Trap",
    "description": "A killer virus called krytos makes its way across Coruscant, decimating the population and sowing seeds of rebellion"
  },
  {
    "youtiniTitle": "X-Wing: Wedge's Gamble",
    "foundTitle": "Wedge's Gamble",
    "description": "Wedge Antilles and his Rogue Squadron team of X-wing pilots are charged with invading the giant towers of the Imperial High Command on the planet of Coruscant for the purpose of gaining vital intelligence information. Original."
  },
  {
    "youtiniTitle": "X-Wing: Wraith Squadron",
    "foundTitle": "Iron Fist: Star Wars Legends (X-Wing)",
    "description": "They are the Rebel Alliance's ultimate strike force--sleek, swift, and deadly. For these X-wing fighters, no job is too dirty or too dangerous. Now they must rise to meet an impossible challenge: stop a powerful warlord by pretending to be his ally. Against all odds, the controversial Wraith Squadron has survived its first covert mission. But now they are called upon to cheat death twice. This time Wedge Antilles sends them in to stop the warlord Zsinj and his Super Star Destroyer, Iron Fist. If Zsinj joins the Empire, it could turn the tide of war against the Rebels. The Wraith Squadron's mission: infiltrate the warlord's fleet and uncover his carefully guarded plans. To do so, they must pose as ruthless pirates seeking to join Zsinj's forces. And that means first becoming pirates in space lanes teeming with Imperial Navy patrols. If that isn't enough to get them killed, they'll have to pass one last test--a suicide mission for Zsinj. Can they survive the test and turn the tables on Zsinj? Or is this the end for Wraith Squadron? Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Tales of Kenobi (Barnes & Noble Collectible Editions)",
    "foundTitle": "Star Wars Tales Vol. 1",
    "description": "Collects Star Wars Tales (1999) #1-4. Collecting the first four issues of the anthology smash sensation, Star Wars Tales contains thrilling stories featuring Darth Vader, Obi-Wan Kenobi, Han Solo, Emperor Palpatine, C-3PO, R2-D2, Lando Calrissian and a cast of thousands! Tales explores every corner of the Star Wars galaxy and keeps readers coming back for more!"
  },
  {
    "youtiniTitle": "Aftermath: Life Debt",
    "foundTitle": "Life Debt: Aftermath (Star Wars)",
    "description": "NEW YORK TIMES BESTSELLER • Set between the events of Return of the Jedi and The Force Awakens, the never-before-told story that began with Star Wars: Aftermath continues in this thrilling novel, the second book of Chuck Wendig’s bestselling trilogy. It is a dark time for the Empire. . . . The Emperor is dead, and the remnants of his former Empire are in retreat. As the New Republic fights to restore a lasting peace to the galaxy, some dare to imagine new beginnings and new destinies. For Han Solo, that means settling his last outstanding debt, by helping Chewbacca liberate the Wookiee’s homeworld of Kashyyyk. Meanwhile, Norra Wexley and her band of Imperial hunters pursue Grand Admiral Rae Sloane and the Empire’s remaining leadership across the galaxy. Even as more and more officers are brought to justice, Sloane continues to elude the New Republic, and Norra fears Sloane may be searching for a means to save the crumbling Empire from oblivion. But the hunt for Sloane is cut short when Norra receives an urgent request from Princess Leia Organa. The attempt to liberate Kashyyyk has carried Han Solo, Chewbacca, and a band of smugglers into an ambush—resulting in Chewie’s capture and Han’s disappearance. Breaking away from their official mission and racing toward the Millennium Falcon’s last known location, Norra and her crew prepare for any challenge that stands between them and their missing comrades. But they can’t anticipate the true depth of the danger that awaits them—or the ruthlessness of the enemy drawing them into his crosshairs. Praise for Aftermath: Life Debt “Star Wars: Aftermath: Life Debt has found its place at the top of all the new canon works. Simply, outstandingly great Star Wars.”—Star Wars Post “[Chuck] Wendig once again strikes gold, offering a sweeping narrative with plenty of insight into both the state of the galaxy at large and beloved characters both new and old.”—Alternative Nation “With an intense plot, political intrigue and great characterization, Wendig’s Aftermath: Life Debt is an excellent read.”—Flickering Myth Praise for Chuck Wendig’s Aftermath “Star Wars: Aftermath [reveals] what happened after the events of 1983’s Return of the Jedi. It turns out, there’s more than just the Empire for the good guys to worry about.”—The Hollywood Reporter “The Force is strong with Star Wars: Aftermath.”—Alternative Nation “The Star Wars universe is fresh and new again, and just as rich and mysterious as it always was.”—Den of Geek"
  },
  {
    "youtiniTitle": "Alphabet Squadron: Shadow Fall",
    "foundTitle": "Shadow Fall (Star Wars)",
    "description": "Alphabet Squadron’s hunt for the deadliest TIE fighters in the galaxy continues in this Star Wars adventure! News of the New Republic’s victory still reverberates through the galaxy. In its wake, the capital ships of the newly legitimized galactic government journey to the farthest stars, seeking out and crushing the remnants of imperial tyranny. But some old ghosts are harder to banish than others. And none are more dangerous than Shadow Wing. Yrica Quell’s ragtag Alphabet Squadron still leads the search for Shadow Wing, but they’re no closer to their goal—and the pressure to find their quarry before it’s too late has begun to shake them apart. Determined to finish the fight once and for all, Quell works with New Republic Intelligence’s contentious Caern Adan and the legendary General Hera Syndulla to prepare the riskiest gambit of her starfighting career—a trap for Shadow Wing that could finish the chase once and for all. But in the darkness, their enemy has evolved. Soran Keize, last of the Imperial aces, has stepped into the power vacuum at the head of Shadow Wing, reinvigorating the faltering unit in their hour of need. Once adrift in the aftershocks of the war, Keize has found meaning again, leading the lost soldiers of his unit through to safety. The only thing standing in his way? The most mismatched squadron in the New Republic Navy, led by his former mentee: the traitor Yrica Quell."
  },
  {
    "youtiniTitle": "Cobalt Squadron",
    "foundTitle": "Star Wars: The Last Jedi Cobalt Squadron",
    "description": "New York Times bestselling author Elizabeth Wein (Code Name Verity, Rose Under Fire) journeys to a galaxy far, far away to bring readers the harrowing story of the courageous bomber pilots and technicians of Cobalt Squadron!"
  },
  {
    "youtiniTitle": "Force Collector",
    "foundTitle": "Journey to Star Wars: The Rise of Skywalker Force Collector",
    "description": "Karr is a teenage boy like many others in the galaxy. He goes to school, helps his parents with the family business, likes speeders and droids. But Karr also has a secret: when he touches certain objects, he gets searing headaches and blacks out. And along with the pain sometimes come visions of people he doesn't know and places he's never been. Karr's parents worry that he's sick; his grandmother is convinced the visions come from the Force. But it's been years since anyone has heard from the last of the Jedi-Luke Skywalker. Are there any Jedi left to guide Karr in the use of his abilities? Is anyone even willing to talk about the Jedi and what happened to them, as their memory continues to fade and the First Order rises? Stuck on his isolated home planet, Karr becomes a collector of historical artifacts, hoping to one day find an object that will give him a vision about the secrets of the Jedi. When his grandmother dies and his parents announce they're sending him away to a school on the other side of the planet, Karr reaches his breaking point. He needs to know what his destiny holds, and whether the Jedi are involved. Accompanied by Maize, the blunt, unpredictable new girl at school with ties to the First Order, and RZ-7, Karr's solicitous droid companion, he sets off into the larger galaxy to find the truth. His adventures will take him from Utapau to Jakku to Takodana and beyond as he learns more about the Jedi than he could have expected?and about his own place in the Force. Praise for Star Wars: Force Collector: \"Kevin Shinick is one of the brightest stars in the Star Wars literary galaxy, and Force Collector shows exactly why!\" - Gary Whitta, screenwriter, Rogue One \"A wonderful journey into the richness of the Star Wars universe. It blasts you into action and adventure at lightspeed. \"- Ahmed Best, actor \"A rollicking, planet-hopping, Force-charged adventure sure to delight Star Wars fans of all ages.\"- Michael Kogge, author of Star Wars The Last Jedi: A Junior Novel \"Shinick invites us into the Star Wars universe through an amazing new character and adds to the canon in unexpected and clever ways.\"- Doug Jung, screenwriter, Star Trek Beyond"
  },
  {
    "youtiniTitle": "From A Certain Point of View",
    "foundTitle": "Star Wars Omnibus",
    "description": "Collects Star Wars: Droids Special #1, Star Wars: Droids - The Kalarba Adventures #1-6, Star Wars: Droids - Artoo's Day Out #1, Star Wars: Droids - Rebellion #1-4, Star Wars: Droids - Season of Revolt #1-4, Star Wars: Droids - The Protocol Offensive #1. Before the clueless C-3PO and his clever companion R2-D2 fell into the sands of Tatooine for their first fateful meeting with Luke Skywalker, those two troublesome droids had some amazing adventures all their own! Sold to a junk trader and shipped off to the treacherous Kalarba system, Artoo and Threepio begin a journey that takes them from the jaws of a droid-eating beast to the frontlines of a revolution! Entagled with pirates, bounty hunters, and the notorious space criminal Olag Greck, they do their best to stick together in a dangerous galaxy where anything can happen!"
  },
  {
    "youtiniTitle": "Galaxy’s Edge: Black Spire",
    "foundTitle": "Galaxy's Edge: Black Spire (Star Wars)",
    "description": "Walk the ancient streets, meet the colorful characters, and uncover the secret history of Star Wars: Galaxy’s Edge, the new expansion to the Disney Parks experience! After devastating losses at the hands of the First Order, General Leia Organa has dispatched her agents across the galaxy in search of allies, sanctuary, and firepower—and her top spy, Vi Moradi, may have just found all three, on a secluded world at the galaxy’s edge. A planet of lush forests, precarious mountains, and towering, petrified trees, Batuu is on the furthest possible frontier of the galactic map, the last settled world before the mysterious expanse of Wild Space. The rogues, smugglers, and adventurers who eke out a living on the largest settlement on the planet, Black Spire Outpost, are here to avoid prying eyes and unnecessary complications. Vi, a Resistance spy on the run from the First Order, is hardly a welcome guest. And when a shuttle full of stormtroopers lands in her wake, determined to root her out, she has no idea where to find help. To survive, Vi will have to seek out the good-hearted heroes hiding in a world that redefines scum and villainy. With the help of a traitorous trooper and her acerbic droid, she begins to gather a colorful band of outcasts and misfits, and embarks on a mission to spark the fire of resistance on Batuu—before the First Order snuffs it out entirely."
  },
  {
    "youtiniTitle": "Guardians of the Whills",
    "foundTitle": "Star Wars: Guardians of the Whills",
    "description": "An exciting adventure about two of the brave heroes from the smash hit movie Rogue One: A Star Wars Story! On the desert world of Jedha, in the Holy City, friends Baze and Chirrut used to be Guardians of the Whills, who looked after the Kyber Temple and the devoted pilgrims who worshipped there. Then the Empire came and took over the planet. The temple was destroyed and the people scattered. Now Baze and Chirrut do what they can to resist the Empire and protect the people of Jedha, but it never seems to be enough. Then a man named Saw Gerrera arrives, with a militia of his own and grand plans to take down the Empire. It seems like the perfect way for Baze and Chirrut to make a real difference and help the people of Jedha live better lives. But will it come at too great a cost?"
  },
  {
    "youtiniTitle": "Heir to the Jedi",
    "foundTitle": "Heir to the Jedi: Star Wars",
    "description": "NEW YORK TIMES BESTSELLER A long time ago in a galaxy far, far away. . . . A thrilling new adventure set between A New Hope and The Empire Strikes Back, and—for the first time ever—written entirely from Luke Skywalker’s first-person point of view. Luke Skywalker’s game-changing destruction of the Death Star has made him not only a hero of the Rebel Alliance but a valuable asset in the ongoing battle against the Empire. Though he’s a long way from mastering the power of the Force, there’s no denying his phenomenal skills as a pilot—and in the eyes of Rebel leaders Princess Leia Organa and Admiral Ackbar, there’s no one better qualified to carry out a daring rescue mission crucial to the Alliance cause. A brilliant alien cryptographer renowned for her ability to breach even the most advanced communications systems is being detained by Imperial agents determined to exploit her exceptional talents for the Empire’s purposes. But the prospective spy’s sympathies lie with the Rebels, and she’s willing to join their effort in exchange for being reunited with her family. It’s an opportunity to gain a critical edge against the Empire that’s too precious to pass up. It’s also a job that demands the element of surprise. So Luke and the ever-resourceful droid R2-D2 swap their trusty X-wing fighter for a sleek space yacht piloted by brash recruit Nakari Kelen, daughter of a biotech mogul, who’s got a score of her own to settle with the Empire. Challenged by ruthless Imperial bodyguards, death-dealing enemy battleships, merciless bounty hunters, and monstrous brain-eating parasites, Luke plunges head-on into a high-stakes espionage operation that will push his abilities as a Rebel fighter and would-be Jedi to the limit. If ever he needed the wisdom of Obi-Wan Kenobi to shepherd him through danger, it’s now. But Luke will have to rely on himself, his friends, and his own burgeoning relationship with the Force to survive. Praise for Heir to the Jedi “Utterly compelling . . . [The novel] plants readers in Luke Skywalker’s boots in the early days of his heroism, during the weeks after he blew up the Death Star.”—New York Daily News “An excellent book with rich characters, bubbling humor and poignant emotion.”—Roqoo Depot “Entertaining . . . action-packed . . . suspenseful.”—New York Journal of Books “Great . . . [an] entertaining introduction into understanding Luke’s character . . . There are moments in The Empire Strikes Back that I now point to and say, ‘I understand how he got there,’ and it’s because of this novel.”—The Wookiee Gunner “Pure Star Wars . . . From shoot-outs to narrow escapes, I could practically hear John Williams’s score playing in my head—a credit to Kevin Hearne, to be sure.”—Coffee with Kenobi “A must-read for fans . . . I left with a much closer understanding of who Luke Skywalker is, and an even deeper admiration for the character. All things are connected in the Force, and I feel more connected to Luke after reading Heir to the Jedi.”—Comicbook"
  },
  {
    "youtiniTitle": "Moving Target: A Princess Leia Adventure",
    "foundTitle": "Moving Target",
    "description": "Princess Leia returns for an all-new adventure in this thrilling upper middle grade novel. Set between Star Wars: The Empire Strikes Back and Star Wars: The Return of the Jedi, the story follows the warrior princess as she leads a ragtag group of rebels on a dangerous mission against the evil Galactic Empire. Hidden in the story are also hints and clues about the upcoming film Star Wars: The Force Awakens, making this a must-read for fans old and new!"
  },
  {
    "youtiniTitle": "Myths & Fables",
    "foundTitle": "Star Wars Myths & Fables",
    "description": "A stunning collection of untold fables, myths, and folklore from the edge of the galaxy. Beautifully illustrated, this unique treasury of in-world space tales takes readers to the far reaches of the Star Wars universe...including to the remote outer rim world of Batuu from Galaxy's Edge."
  },
  {
    "youtiniTitle": "Queen's Shadow",
    "foundTitle": "Star Wars Queen's Shadow",
    "description": "Written by the #1 New York Times best-selling author of Ahsoka! When Padmé Naberrie, \"Queen Amidala\" of Naboo, steps down from her position, she is asked by the newly-elected queen to become Naboo's representative in the Galactic Senate. Padmé is unsure about taking on the new role, but cannot turn down the request to serve her people. Together with her most loyal handmaidens, Padmé must figure out how to navigate the treacherous waters of politics and forge a new identity beyond the queen's shadow."
  },
  {
    "youtiniTitle": "Tarkin",
    "foundTitle": "Tarkin: Star Wars",
    "description": "Tells the complete tale of Grand Moff Tarkin, who guides the creation of the Death Star and paves the way for the Empire's supremacy--and whom even the dreaded Darth Vader obeys."
  },
  {
    "youtiniTitle": "The Force Awakens (YA)",
    "foundTitle": "Star Wars The Rise of Skywalker Junior Novel",
    "description": "Something has awakened. Every generation has a legend. Nobody's every really gone. The conclusion of the Skywalker Saga is finally here. This junior novel retelling of Star Wars: The Rise of Skywalker, contains deleted and extended scenes, including exclusive scenes you won't find anywhere else! This book also includes an 8-page full-color insert."
  },
  {
    "youtiniTitle": "The Force Awakens: Finn's Story",
    "foundTitle": "Star Wars Finn's Story",
    "description": "Experience Star Wars: The Force Awakens from the point of view of one of the film's biggest breakout characters! Finn is a former First Order stormtrooper with a unique story. Follow along as he gets swept up into an adventure he never thought possible!"
  },
  {
    "youtiniTitle": "The Force Awakens: Rey's Story",
    "foundTitle": "Star Wars The Force Awakens: Rey''s Story",
    "description": "Rey never thought she would leave the desert planet of Jakku, but her life is turned upside down when she meets BB-8, a small droid with a big secret. Like it or not, Rey is about to be caught up in something much larger than herself: a galactic war between the evil First Order and the fledgling Resistance. But something is awakening inside of Rey, something that might turn the tides of fortune in the galaxy. . . . This Chapter Book that retells The Force Awakens from the perspective of one of the film's biggest breakout characters!"
  },
  {
    "youtiniTitle": "The Weapon of a Jedi: A Luke Skywalker Adventure",
    "foundTitle": "Journey to Star Wars: The Force Awakens The Weapon of a Jedi",
    "description": "Luke Skywalker returns for an all-new adventure in this thrilling upper middle grade novel. Set between Star Wars: A New Hope and Star Wars: The Empire Strikes Back, the story finds Luke Skywalker, C-3PO, and R2-D2 stranded on a mysterious planet, and explores a dangerous duel between Luke and a strange new villain. Hidden in the story are also clues and hints about the upcoming film Star Wars: The Force Awakens, making this a must-read for fans old and new!"
  },
  {
    "youtiniTitle": "Thrawn",
    "foundTitle": "Thrawn (Star Wars)",
    "description": "NEW YORK TIMES BESTSELLER • In this definitive novel, readers will follow Thrawn’s rise to power—uncovering the events that created one of the most iconic villains in Star Wars history. One of the most cunning and ruthless warriors in the history of the Galactic Empire, Grand Admiral Thrawn is also one of the most captivating characters in the Star Wars universe, from his introduction in bestselling author Timothy Zahn’s classic Heir to the Empire through his continuing adventures in Dark Force Rising, The Last Command, and beyond. But Thrawn’s origins and the story of his rise in the Imperial ranks have remained mysterious. Now, in Star Wars: Thrawn, Timothy Zahn chronicles the fateful events that launched the blue-skinned, red-eyed master of military strategy and lethal warfare into the highest realms of power—and infamy. Praise for Thrawn “The origin story of one of the greatest Star Wars villains . . . a book that fans have wanted for decades.”—The Verge “A satisfying tale of political intrigue . . . Thrawn’s observations and tactical thinking are utterly captivating.”—New York Daily News “Quite the page-turner.”—Flickering Myth"
  },
  {
    "youtiniTitle": "Thrawn: Ascendancy: Chaos Rising",
    "foundTitle": "Star Wars: Thrawn Ascendancy (Book I: Chaos Rising)",
    "description": "NEW YORK TIMES BESTSELLER • Discover Thrawn’s origins within the Chiss Ascendancy in the first book in an epic new Star Wars trilogy from bestselling author Timothy Zahn. Beyond the edge of the galaxy lies the Unknown Regions: chaotic, uncharted, and near impassable, with hidden secrets and dangers in equal measure. And nestled within its swirling chaos is the Ascendancy, home to the enigmatic Chiss and the Nine Ruling Families that lead them. The peace of the Ascendancy, a beacon of calm and stability, is shattered after a daring attack on the Chiss capital that leaves no trace of the enemy. Baffled, the Ascendancy dispatches one of its brightest young military officers to root out the unseen assailants. A recruit born of no title, but adopted into the powerful family of the Mitth and given the name Thrawn. With the might of the Expansionary Fleet at his back, and the aid of his comrade Admiral Ar’alani, answers begin to fall into place. But as Thrawn’s first command probes deeper into the vast stretch of space his people call the Chaos, he realizes that the mission he has been given is not what it seems. And the threat to the Ascendancy is only just beginning."
  },
  {
    "youtiniTitle": "Queen's Hope",
    "foundTitle": "Queen's Hope",
    "description": "A peace-loving senator faces a time of war in another thrilling Padmé Amidala adventure from the author of the New York Times best-sellers Queen's Peril and Queen's Shadow!"
  },
  {
    "youtiniTitle": "Thrawn Ascendancy: Lesser Evil",
    "foundTitle": "Star Wars: Thrawn Ascendancy (Book III: Lesser Evil)",
    "description": "NATIONAL BESTSELLER • The fate of the Chiss Ascendancy hangs in the balance in the epic finale of the Star Wars: Thrawn Ascendancy trilogy from Timothy Zahn. For thousands of years the Chiss Ascendancy has been an island of calm, a center of power, and a beacon of integrity. It is led by the Nine Ruling Families, whose leadership stands as a bulwark of stability against the Chaos of the Unknown Regions. But that stability has been eroded by a cunning foe who winnows away trust and loyalty in equal measure. Bonds of fidelity have given way to lines of division among the families. Despite the efforts of the Expansionary Defense Fleet, the Ascendancy slips closer and closer to civil war. The Chiss are no strangers to war. Their mythic status in the Chaos was earned through conflict and terrible deeds, some long buried. Until now. To ensure the Ascendancy’s future, Thrawn will delve deep into its past, uncovering the dark secrets surrounding the ascension of the First Ruling Family. But the truth of a family’s legacy is only as strong as the legend that supports it. Even if that legend turns out to be a lie. To secure the salvation of the Ascendancy, is Thrawn willing to sacrifice everything? Including the only home he has ever known?"
  },
  {
    "youtiniTitle": "Agents of Chaos I: Hero's Trial",
    "foundTitle": "Hero's trial",
    "description": "As attacks by an alien force threaten to devastate the New Republic, Han Solo seeks solace from his grief over the death of Chewbacca and embarks on a quest to avenge his partner's death."
  },
  {
    "youtiniTitle": "Apocalypse",
    "foundTitle": "Apocalypse",
    "description": "Jedi and Sith face off - with Coruscant as their battlefield. For the Sith, it's the chance to restore their dominance over the galaxy that forgot them for so long. For Abeloth, it's a giant step in her quest to conquer all life everywhere. For Luke Skywalker, it's a call to arms to eradicate the Sith and their monstrous new master once and for all."
  },
  {
    "youtiniTitle": "Backlash",
    "foundTitle": "Backlash",
    "description": "Countering growing mistrust in the wake of increasing cases of insanity among the Jedi, Han and Leia flee with three afflicted Jedi, while Luke travels to the homeworld of the Night Sister to learn why Jacen Solo turned to the dark side. Reprint. A best-selling book."
  },
  {
    "youtiniTitle": "Champions of the Force",
    "foundTitle": "Champions of the Force"
  },
  {
    "youtiniTitle": "Cloak of Deception",
    "foundTitle": "Star Wars",
    "description": "A prequel to The Phantom Menace considers the truth behind Chancellor Valorum's fall from power and his friendship with the enigmatic Jedi Master, Qui-Gon Jinn. Reissue."
  },
  {
    "youtiniTitle": "Conviction",
    "foundTitle": "Conviction: Star Wars Legends (Fate of the Jedi)",
    "description": "NEW YORK TIMES BESTSELLER The Jedi have struck a blow against tyranny. Can they strike down ultimate evil? Chief of State Natasi Daala has been overthrown, and the Jedi Order has taken control of the Galactic Alliance. But while the new governors dismantle Daala’s draconian regime, forces still loyal to the deposed official are mobilizing a counterstrike. And even the Jedi’s new authority may not be enough to save Tahiri Veila, the former Jedi Knight and onetime Sith apprentice convicted of treason for the killing of Galactic Alliance officer Gilad Pellaeon. Meanwhile, Luke and Ben Skywalker are relentlessly pursuing Abeloth, the powerful dark-side entity bent on ruling the galaxy. But as they corner their monstrous quarry on the planet Nam Chorios, the two lone Jedi must also face the fury of the Sith death squadron bearing down on them. And when Abeloth turns the tables with an insidious ambush, the Skywalkers’ quest threatens to become a suicide mission. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Crucible",
    "foundTitle": "Crucible",
    "description": "When Han and Leia Solo arrive at Lando Calrissian's Outer Rim mining operation to help him fend off a hostile takeover, they join forces with Luke Skywalker to confront a dangerous adversary with evil intentions and a vendetta against Han."
  },
  {
    "youtiniTitle": "Dark Force Rising",
    "foundTitle": "Dark Force Rising",
    "description": "Five years after the return of the Jedi, the Republic stands threatened from within and without. Grand Admiral Thrawn has taken command of the remnants of the imperial fleet and has launched a campaign to destroy the Republic, planning to impose his iron will on the galaxy. As Princess Leia, pregnant with Jedi twins, risks her life to ally a proud and lethal race with the Republic, Han and Lando Calrissian race against time to find proof of treason within the Council. Most dangerous of all is a new Dark Jedi, insane and scheming to summon young Skywalker and to corrupt him to the Dark Side."
  },
  {
    "youtiniTitle": "Dark Journey",
    "foundTitle": "Dark Journey: Star Wars Legends",
    "description": "The New Jedi Order continues as Jaina Solo struggles with anger and despair after the Jedi Knights' harrowing adventure behind enemy lines. Though the Jedi strike force completed its deadly mission into Yuuzhan Vong territory, the price of success was tragedy: not everyone made it out alive. In a daring getaway, hotshop pilot Jaina Solo stole an enemy ship, taking along her fellow survivors--and leaving behind a huge piece of her heart. With the enemy in hot pursuit, Jaina is forced to seek haven in the unprotected, unfriendly Hapes Cluster, where the Jedi are held responsible for a past tragedy--and where the royal family has grim plans for their famous Jedi guest. Even more sinister are the intentions of the Yuuvhan Vong, desperate to capture Jaina for a hideous sacrifice. Grief-stricken and obsessed with revenge, Jaina is blind to these threats--and to the overpowering evil dangerously close to consuming her. In the coming conflagration, Jaina will be fighting not for victory or vengeance, but fore her very being . . . Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Dark Tide I: Onslaught",
    "foundTitle": "Onslaught: Star Wars Legends",
    "description": "In this epic of unsurpassed action and imagination, Michael Stackpole helps to launch an exciting era in Star Wars history. Onslaught pits the battle-tested heroes of the past—Luke Skywalker, Han Solo, and Leia Organa Solo—along with the next generation of Jedi and droids, against fearsome never-before-encountered enemies from beyond the galactic rim . . . It is a perilous time for the New Republic. Just when unity is needed most, mistrust is on the rise. Even the Jedi feel the strain, as rogue elements rebel against Luke's leadership. When alien invaders known as the Yunnan Vong strike without warning, the New Republic is thrown on the defensive. Merciless warriors, the Yunnan Vong glory in torture. Their technology is as strange as it is deadly. Most ominous of all, they are impervious to the Force. Now Luke must wield all the awesome powers of a Jedi Master to defeat the gravest threat since Darth Vader. As Leia and Gavin Darklighter lead desperate refugees in a fighting retreat from Yunnan Vong forces, Mara Jade, Anakin, Jacen, and Corran Horn find themselves tested as never before by a faceless, implacable foe determined to smother the light of the New Republic forever beneath a shroud of darkest evil . . . Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Dark Tide II: Ruin",
    "foundTitle": "Ruin: Star Wars Legends",
    "description": "New York Times bestselling author Michael A. Stackpole continues The New Jedi Order epic with Dark Tide II: Ruin, a thrilling Star Wars adventure in which the Jedi Knights must fight their most treacherous battle—against an unrelenting evil intent on devouring the galaxy. . . . The alien Yuuzhan Vong have launched an attack on the worlds of the Outer Rim. They are merciless, without regard for life—and they stand utterly outside the Force. Their ever-changing tactics stump the New Republic military. Even the Jedi, once the greatest guardians of peace in the galaxy, are rendered helpless by this impervious foe—and their solidarity has begun to unravel. While Luke struggles to keep the Jedi together, Knights Jacen Solo and Corran Horn set off on a reconnaissance mission to the planet Garqi, an occupied world. There, at last, they uncover a secret that might be used to undermine the enemy—if only they can stay alive long enough to use it! Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Darth Bane: Path of Destruction",
    "foundTitle": "Darth Bane",
    "description": "Millennia before the rise of Darth Vader and Darth Sidious, in an Old Republic marked by an ongoing struggle between the Sidi and Jedi, Darth Bane plots to bring down the Brotherhood of the Sith and to replace it with a more powerful order."
  },
  {
    "youtiniTitle": "Destiny's Way",
    "foundTitle": "Destiny's Way",
    "description": "Following the fall of Coruscant to the Yuuzhan Vong, the New Republic is torn apart by internal strife as a dangerous new faction opposed to the ways of the Force unveils a weapon that could destroy their enemies and make them vulnerable to the dark side."
  },
  {
    "youtiniTitle": "Empire and Rebellion: Honor Among Thieves",
    "foundTitle": "Honor Among Thieves",
    "description": "Han Solo and his new friends embark on a daring rescue mission just after the destruction of the first Death Star."
  },
  {
    "youtiniTitle": "Exile",
    "foundTitle": "Exile",
    "description": "As Jacen Solo continues his victorious campaign against the Corellian rebels, Han and Leia Solo and Luke and Mara Skywalker begin to suspect that someone has been manipulating the war, and unless the enemy can be stopped, galactic peace will be impossible."
  },
  {
    "youtiniTitle": "Force Heretic II: Refugee",
    "foundTitle": "Star Wars: The New Jedi Order - Force Heretic II Refugee",
    "description": "The second of a mass-market original trilogy charting the beginning of the galaxy's victory over the dreaded Yuuzhan Vong alien invaders. Under the leadership of Luke Skywalker and a combined Jedi-government council, the newly formed Galatic Federation of Free Alliances is doggedly fighting back--and winning. Luke is on a quest for a legend, in hope of bringing back the ultimate answer to the war. And a mysterious prophet has risen among the Yuuzhan Vong lower castes to turn Yuuzhan Vong culture on its ear. This adventure includes major storylines for favorite characters, both old and new."
  },
  {
    "youtiniTitle": "Han Solo At Stars' End",
    "foundTitle": "The Han Solo Adventures",
    "description": "Contains three separate stories about the outer space adventures of Star Wars hero Han Solo and his friend and copilot Chewbacca."
  },
  {
    "youtiniTitle": "Labyrinth of Evil",
    "foundTitle": "Star Wars: Labyrinth of Evil",
    "description": "A Jedi adventure that is a direct prequel to the upcoming movie, Star Wars: Episode III Revenge of the Sith! Based on information from George Lucas and written by bestselling Star Wars author James Luceno, this book leads directly into the explosive opening scene of the new blockbuster movie. Now a full-fledged Jedi Knight, Anakin Skywalker sets out on his first mission with Obi-Wan Kenobi as an equal, instead of as a Padawan apprentice. As they search desperately for clues to the wherabouts of the evil Sith Lord, Darth Sidiuos, they find themselves caught in an intricately woven web of lies that leads them right into the action-packed opening sequence of the upcoming blockbuster movie, Star Wars: Episode III Revenge of the Sith!"
  },
  {
    "youtiniTitle": "MedStar I: Battle Surgeons",
    "foundTitle": "Battle Surgeons: Star Wars Legends (Medstar, Book I)",
    "description": "As Civil War between the Republic and the Separatists rages across the galaxy, nowhere is the fighting more fierce than on the swamp world of Drongar, where a beleaguered mobile hospital unit wages a never-ending war of its own . . . A surgeon who covers his despair with wise-cracks; another who faces death and misery head-on, venting his emotions through beautiful music . . . A nurse with her heart in her work and her eye on a doctor . . . A Jedi Padawan on a healing mission without her Master . . . These are the core members of a tiny med unit serving the jungle world of Drongar, where battle is waged over the control of a priceless native plant, and an endless line of medlifters brings in the wounded and dying—mostly clone troopers, but also soldiers of all species. While the healers work desperately to save lives, others plot secretly to profit from the war—either by dealing on the black market or by manipulating the events of the war itself. In the end, though, all will face individual tests, and only those of compassionate hearts and staunch spirits can hope to survive to fight another day. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Revelation",
    "foundTitle": "Star Wars: Legacy of the Force VIII - Revelation",
    "description": "In his new mantle as Sith Lord, Jacen Solo's dark powers reach a peak as he continues to crush opposition across the warring galaxy and bring his dream of a new order closer to fruition. But those who once fought at his side now turn against him, and as his unexpected enemies rally to the confederacy, Ben Skywalker discovers the full and terrible truth of how his mother died."
  },
  {
    "youtiniTitle": "Scourge",
    "foundTitle": "Scourge",
    "description": "When a novice Jedi is killed while trying to obtain the coordinates of a secretive, yet beneficial trade route, his former Master, Jedi archivist Mander Zuma, must enter the dangerous underworld of the Hutts to find the truth. Original. 60,000 first printing."
  },
  {
    "youtiniTitle": "Shadows of the Empire",
    "foundTitle": "Shadows of the Empire",
    "description": "A novel set during the period between The Empire Strikes Back and Return of the Jedi follows Leia's preparations to rescue Han Solo and Luke's flight from both Darth Vader and an equally powerful dark lord, Xizor. Reprint."
  },
  {
    "youtiniTitle": "Star Wars Episode III: Revenge of the Sith",
    "foundTitle": "Star Wars, Episode III.",
    "description": "Follows Anakin Skywalker as he struggles with his duty as a Jedi Knight and his role as the secret husband of Senator Padme Amidala, and chronicles the creation of Darth Vader and the birth of Luke Skywalker and Princess Leia Organa."
  },
  {
    "youtiniTitle": "Star Wars Episode V: The Empire Strikes Back",
    "foundTitle": "The Empire Strikes Back",
    "description": "Although the infamous Death Star has been destroyed and a Rebel base established on the frozen planet of Hoth, Luke Skywalker, Princess Leia, and Han Solo again find themselves pursued by Darth Vader"
  },
  {
    "youtiniTitle": "Star Wars Episode V: The Empire Strikes Back (YA)",
    "foundTitle": "Star Wars: Classic Trilogy",
    "description": "Devour the original Star Wars saga with this eBook collection of Episode IV A New Hope, Episode V The Empire Strikes Back, and Episode VI Return of the Jedi. Become entranced with the basic struggle of good vs. evil as you travel to a galaxy far, far away."
  },
  {
    "youtiniTitle": "Star Wars Episode VI: Return of the Jedi",
    "foundTitle": "Return of the Jedi",
    "description": "Luke Skywalker and his friends in the Rebel Alliance formulate a daring plan to battle with the Empire and its evil leaders, Darth Vader and the Emperor."
  },
  {
    "youtiniTitle": "Star Wars Episode VI: Return of the Jedi (YA)",
    "foundTitle": "Star Wars®: Episode VI: Return of the Jedi",
    "description": "The Emperor. The Ewoks. Jabba the Hutt. The climactic lightsaber battle . . . an amazing all-new novelization tying into the massive DVD release of the classic Star Wars movies. The Emperor. The Ewoks. Jabba the Hutt. The climactic lightsaber battle . . . an amazing all-new novelization tying into the massive DVD release of the classic Star Wars movies."
  },
  {
    "youtiniTitle": "Star Wars: The Clone Wars",
    "foundTitle": "Star Wars",
    "description": "The Jedi Knights lead the battle against a powerful droid army of separatists, while Anakin Skywalker mentors his first Padawan, a girl named Ahsoka, while learning the skills of a warrior and becoming a hero of the Clone Wars, in a novelization of a new television animated feature film and series. Original. (A Cartoon Network series, created by Lucasfilm Animation, premiering August 2008) (Science Fiction)"
  },
  {
    "youtiniTitle": "Survivor's Quest",
    "foundTitle": "Star Wars",
    "description": "Three years after his marriage to Mara Jade, Luke receives word that the remains of the legendary Outbound Flight Project have been found, prompting Luke and Mara to join a team of adventurers on an expedition into the Unknown Regions."
  },
  {
    "youtiniTitle": "Tatooine Ghost",
    "foundTitle": "Tatooine Ghost: Star Wars Legends",
    "description": "Han Solo and Leia Organa take center stage, and stunning revelations from the past play a critical role in shaping the future, as the New York Times bestselling author of Star Wars: The New Jedi Order: Star by Star now turns to a crucial chapter in the classic Star Wars saga. The deaths of Darth Vader and Emperor Palpatine, and victory at the Battle of Endor by no means spelled the end of the Empire. In the aftermath, the New Republic has faced a constant struggle to survive and grow. And now a new threat looms: a masterpiece of Alderaanian art—lost in transit after the planet’s destruction—has resurfaced on the black market. Offered at auction, it will command a handsome price . . . but its greatest value lies in the vital secret it conceals—the key to a code used to communicate with New Republic agents deep undercover within the Empire. Discovery of the key by Imperial forces would spell certain disaster. The only option is recovery—and Han, Leia, Chewbacca, and C-3PO have been dispatched to Tatooine to infiltrate the auction. But trouble is waiting when they arrive: an Imperial Star Destroyer is orbiting Tatooine on the lookout for Rebels; a mysterious stranger at the auction seems to recognize Leia; and an Imperial officer’s aggressive bidding for the Alderaanian painting could foil the Solos’ mission. When a dispute erupts into violence, and the painting vanishes in the chaos, Han and Leia are thrust into a desperate race to reclaim it—before Imperial troops or a band of unsavory treasure-peddlers get there first. Dangerous as the chase is, for Leia it leads into especially dark territory. Already haunted by the specter of her infamous father, and fearful that his evil may infect future generations, she has suffered a disturbing Force-vision of Luke turning to the dark side. As she battles beside Han against marauding TIE fighters, encroaching stormtroopers, and Tatooine’s savage Tusken Raiders, Leia’s struggle with the warring emotions inside her culminates in the discovery of an extraordinary link to the past. And as long-buried secrets and truths at last emerge, she faces a moment of reckoning that will forever alter her destiny . . . and that of the New Republic. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Tempest",
    "foundTitle": "Tempest (Star Wars: Legacy of the Force #3)."
  },
  {
    "youtiniTitle": "The Courtship of Princess Leia",
    "foundTitle": "The Courtship of Princess Leia",
    "description": "Han Solo confronts a new rival for Princess Leia's affections in the person of Prince Isolder, who will ally the sixty-three high-tech worlds of the Hapes Consortium with the New Republic, if Leia will marry him"
  },
  {
    "youtiniTitle": "The Crystal Star",
    "foundTitle": "The Crystal Star: Star Wars Legends",
    "description": "Hugo and Nebula award-winning author Vonda N. McIntyre continues the bestselling Star Wars saga as the ultimate space adventure unfolds in The Crystal Star. Princess Leia's children have been kidnapped. Along with Chewbacca and Artoo-Detoo, she follows the kidnappers' trail to a disabled refugee ship, from which children are also missing. Here she learns of a powerful Imperial officer with a twisted plan to restore the Empire. Meanwhile, Han Solo and Luke Skywalker are cut off from Leia by the death of a nearby star, which has caused a disruption in the Force. They have gone to the planet Crseih to investigate a report of a lost group of Jedi. Instead they find a charismatic alien named Waru whose miraculous healing powers have attracted a fanatic following. As Leia follows the path of her children across space, Luke and Han draw closer to the truth behind Waru's sinister cult. Together they will face an explosive showdown that will decide the survival of the New Republic . . . and the universe itself! Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "The Final Prophecy",
    "foundTitle": "Star Wars: The New Jedi Order - The Final Prophecy",
    "description": "The last original mass-market paperback and the penultimate book in the bestselling Star Wars: The New Jedi Order series! At last we learn more of the history of the Yuuzhan Vong invaders--where they come from and why they are out to conquer the galaxy far, far away. And the scene is set up for the final, exciting climax of the series, this November's hardcover STAR WARS: THE NEW JEDI ORDER: THE UNIFYING FORCE!"
  },
  {
    "youtiniTitle": "The Joiner King",
    "foundTitle": "The Joiner King",
    "description": "Luke Skywalker, followed by Han and Leia, heads for the Unknown Regions, when a handful of Jedi Knights, including Jaina and Jacen Solo, vanish there after responding to a strange cry for help that only they can hear, hoping to stop all out war between the alien Chiss and an unknown aggressor. Original."
  },
  {
    "youtiniTitle": "The Old Republic: Deceived",
    "foundTitle": "Deceived: Star Wars Legends (the Old Republic)",
    "description": "\"Our time has come. For three hundred years we prepared; we grew stronger while you rested in your cradle of power. . . . Now your Republic shall fall.\" A Sith warrior to rival the most sinister of the Order's Dark Lords, Darth Malgus brought down the Jedi Temple on Coruscant in a brutal assault that shocked the galaxy. But if war crowned him the darkest of Sith heroes, peace will transform him into something far more heinous--something Malgus would never want to be but cannot stop becoming, any more than he can stop the rogue Jedi fast approaching. Her name is Aryn Leneer--and the lone Jedi Knight that Malgus cut down in the fierce battle for the Jedi Temple was her Master. Now she's going to find out what happened to him, even if it means breaking every rule in the book."
  },
  {
    "youtiniTitle": "The Swarm War",
    "foundTitle": "Star Wars: Dark Nest III: The Swarm War",
    "description": "The third and last book in the all-new trilogy that will bridge the events of the hugely popular New Jedi Order series, which has sold four million copies to date, and our upcoming 9-book epic Star Wars series to be published in 2006-2008. With the Jedi Order splintered by conflicts of conscience, and a war erupting between the Killiks and Chiss that could spread across the entire galaxy, Luke Skywalker takes charge. His bold plan will play all sides against each other and carry those closest to him deep into hostile territory. It is also the only thing standing between the galaxy and the eternal war that his nephew, Jacen, has foreseen in visions. For the Jedi to succeed, they must step beyond the reach of any galactic government and undermine the war-making capabilities of all sides -- and Luke Skywalker must assume his fated role as true master of the Jedi Order."
  },
  {
    "youtiniTitle": "Tyrant's Test",
    "foundTitle": "Tyrant's Test",
    "description": "Chewbacca embarks on a desperate mission to rescue Han Solo from his brutal Yevetha captors, while Princess Leia calls upon the Senate to end the Yevetha threat, which could cost Han his life, and Luke continues his perilous search for his mother. Original."
  },
  {
    "youtiniTitle": "The Bounty Hunter Wars (Barnes & Noble Collectible Editions)",
    "foundTitle": "Bounty Hunter Code",
    "description": "Legendary bounty hunter Boba Fett bound together two volumes of great personal significance: an edition of The Bounty Hunter's Guild Handbook, and a recruiting booklet issued by Death Watch, a secretive splinter group of Mandalorians. Together, these volumes make up The Bounty Hunter Code, detailing the skills needed to make a living beyond galactic law as well as the little-known history, philosophy, and gear of Death Watch. With notes from the books' former owners, this collection serves as a crucial guide to the bounty hunter's essential tools and techniques."
  },
  {
    "youtiniTitle": "Ahsoka",
    "foundTitle": "Star Wars Ahsoka",
    "description": "Fans have long wondered what happened to Ahsoka after she left the Jedi Order near the end of the Clones Wars, and before she re-appeared as the mysterious Rebel operative Fulcrum in Rebels. Finally, her story will begin to be told. Following her experiences with the Jedi and the devastation of Order 66, Ahsoka is unsure she can be part of a larger whole ever again. But her desire to fight the evils of the Empire and protect those who need it will lead her right to Bail Organa, and the Rebel Alliance..."
  },
  {
    "youtiniTitle": "Alphabet Squadron: Victory's Price",
    "foundTitle": "Alphabet Squadron 3",
    "description": "The epic conclusion to the Star Wars: Alphabet Squadron trilogy, following Alphabet Squadron and Shadow Fall."
  },
  {
    "youtiniTitle": "Battlefront II: Inferno Squad",
    "foundTitle": "Battlefront II: Inferno Squad (Star Wars)",
    "description": "NEW YORK TIMES BESTSELLER * Set in the aftermath of Rogue One: A Star Wars Story, this action-packed prequel to the hotly anticipated videogame Battlefront II introduces the Empire's elite force: Inferno Squad. After the humiliating theft of the Death Star plans and the destruction of the battle station, the Empire is on the defensive. But not for long. In retaliation, the elite Imperial soldiers of Inferno Squad have been called in for the crucial mission of infiltrating and eliminating the Partisans--the rebel faction once led by notorious Republic freedom fighter Saw Gerrera. Following the death of their leader, the Partisans have carried on his extremist legacy, determined to thwart the Empire--no matter the cost. Now Inferno Squad must prove its status as the best of the best and take down the Partisans from within. But the growing threat of being discovered in their enemy's midst turns an already dangerous operation into a do-or-die acid test they dare not fail. To protect and preserve the Empire, to what lengths will Inferno Squad go . . . and how far beyond them? The Rebellion may have heroes like Jyn Erso and Luke Skywalker. But the Empire has Inferno Squad. Praise for Battlefront II: Inferno Squad \"Wow . . . This book is a must-read. Christie Golden just knocked it out of the park!\"--The Geek's Attic \"[A] great space thriller . . . full of action, drama and character.\"--Rebels Report"
  },
  {
    "youtiniTitle": "Bloodline",
    "foundTitle": "Bloodline",
    "description": "The Sunday Times Bestseller WITNESS THE BIRTH OF THE RESISTANCE When the Rebellion defeated the Empire in the skies above Endor, Leia Organa believed it was the beginning to a lasting peace. But after decades of vicious infighting and partisan gridlock in the New Republic Senate, that hope seems like a distant memory. Now a respected senator, Leia must grapple with the dangers that threaten to cripple the fledgling democracy-from both within and without. Underworld kingpins, treacherous politicians, and Imperial loyalists are sowing chaos in the galaxy. Desperate to take action, senators are calling for the election of a First Senator. It is their hope that this influential post will bring strong leadership to a divided galaxy. As the daughter of Darth Vader, Leia faces with distrust the prospect of any one person holding such a powerful position-even when supporters suggest Leia herself for the job. But a new enemy may make this path Leia's only option. For at the edges of the galaxy, a mysterious threat is growing..."
  },
  {
    "youtiniTitle": "Dark Legends",
    "foundTitle": "Star Wars Dark Legends",
    "description": "Read on if you dare! This unique in-world collection hallows the spooky tales and ghost stories that would have kept young Luke and Leia up at night. Created by George Mann and Grant Griffin--the same team behind the stunning Star Wars: Myths & Fables--these six frightful fables have been carefully woven from the expansive fabric that is the Star Wars galaxy (including the thrilling landscape from Galaxy's Edge at Disneyland and Disney World), and beautifully painted in a lush illustrative style that feels intergalactic yet innately archetypal and timeless."
  },
  {
    "youtiniTitle": "Master & Apprentice",
    "foundTitle": "Star Wars: The Secrets of the Jedi",
    "description": "2020 IBPA Awards Winner! Discover the world of Star Wars’ Jedi through this fun and fully interactive reading experience. Join Jedi Master Luke Skywalker on a fully interactive journey into the world of the Jedi. Discover the storied history of this noble order of peacekeepers; explore the secrets of the Force; study the art of mastering the lightsaber; and learn about the lives of some of the most revered Jedi of all time, including Yoda, Obi-Wan Kenobi, and Anakin Skywalker. Featuring amazing original illustrations and unique special features—including a pop-up holocron, a translator card, a Jedi equipment booklet, pullouts, and more—this book is the ultimate exploration of the Jedi and their incredible impact on the galaxy."
  },
  {
    "youtiniTitle": "Smuggler's Run: A Han Solo & Chewbacca Adventure",
    "foundTitle": "Journey to Star Wars: The Force Awakens:Smuggler's Run",
    "description": "Han Solo and Chewbacca the Wookiee team-up for an all-new adventure in this thrilling upper middle grade novel. Set between Star Wars: A New Hope and Star Wars: The Empire Strikes Back, the story follows everyone's favorite pair of smugglers as they fly the Millennium Falcon on a top-secret mission for the Rebellion. Hidden in the story are also hints and clues about the upcoming film, Star Wars: The Force Awakens, making this a must-read for fans old and new!"
  },
  {
    "youtiniTitle": "Star Wars Episode VII: The Force Awakens",
    "foundTitle": "The Force Awakens",
    "description": "\"Screenplay written by Lawrence Kasdan & J.J. Abrams and Michael Arndt; based on characters created by George Lucas.\""
  },
  {
    "youtiniTitle": "Thrawn: Treason",
    "foundTitle": "Thrawn: Treason (Star Wars)",
    "description": "NEW YORK TIMES BESTSELLER • Grand Admiral Thrawn faces the ultimate test of his loyalty to the Empire in this epic Star Wars novel from bestselling author Timothy Zahn. “If I were to serve the Empire, you would command my allegiance.” Such was the promise Grand Admiral Thrawn made to Emperor Palpatine at their first meeting. Since then, Thrawn has been one of the Empire’s most effective instruments, pursuing its enemies to the very edges of the known galaxy. But as keen a weapon as Thrawn has become, the Emperor dreams of something far more destructive. Now, as Thrawn’s TIE defender program is halted in favor of Director Krennic’s secret Death Star project, he realizes that the balance of power in the Empire is measured by more than just military acumen or tactical efficiency. Even the greatest intellect can hardly compete with the power to annihilate entire planets. As Thrawn works to secure his place in the Imperial hierarchy, his former protégé Eli Vanto returns with a dire warning about Thrawn’s homeworld. Thrawn’s mastery of strategy must guide him through an impossible choice: duty to the Chiss Ascendancy, or fealty to the Empire he has sworn to serve. Even if the right choice means committing treason. Praise for Thrawn: Treason “Another excellent addition to the new canon . . . Thrawn: Treason will reward you thoroughly for your time.”—GeekMom “If you’ve ever enjoyed a Thrawn story—whether that was Heir to the Empire and its sequels or Zahn’s new novels—you’ll find more of what you enjoy in Treason.”—Dork Side of the Force"
  },
  {
    "youtiniTitle": "Ambush at Corellia",
    "foundTitle": "Ambush at Corellia: Star Wars Legends (The Corellian Trilogy)",
    "description": "A trade summit on Corellia brings Han Solo back to the home world he left many years before. Arriving on the distant planet with Leia, their children and Chewbacca, Han finds Corellia overrun with agents of the New Republic Intelligence and finds himself part of a deceptive plan whose aim not even he understands. One thing is clear: the five inhabited worlds of the sector are on the brink of civil war and the once peaceful coexistence of the three leading races -- human, Selonian, and Drallan -- has come to an end. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Clone Wars Gambit: Siege",
    "foundTitle": "Siege",
    "description": "Trapped on the planet Lanteeb while working to outmaneuver General Lok Durd's droid army, Obi-Wan Kenobi and a grown Anakin Skywalker seek shelter in a remote village where they are attacked by Separatist forces. By the author of Wild Space. Original. Media tie-in."
  },
  {
    "youtiniTitle": "Coruscant Nights II: Street of Shadows",
    "foundTitle": "Street of Shadows",
    "description": "Jedi private detective Jax Pavan finds himself in deadly danger when he is hired by a beautiful and mysterious Zeltron, who wants him to find out who killed her artist lover, and he is targeted by the infamous Darth Vader."
  },
  {
    "youtiniTitle": "Darth Plagueis",
    "foundTitle": "Star Wars",
    "description": "Darth Plagueis, a Sith Lord who knows the Dark Side so well that he has power over life and death, joins forces with his apprentice, one-day emperor Darth Sidious, to try to dominate the whole galaxy. Reprint. Movie tie-in."
  },
  {
    "youtiniTitle": "Death Star",
    "foundTitle": "Death Star: Star Wars Legends",
    "description": "“THAT’S NO MOON.” –Obi-Wan Kenobi The Death Star’s name says it all, with bone-chilling accuracy. It is a virtual world unto itself–equipped with uncanny power for a singularly brutal purpose: to obliterate entire planets in the blink of an eye. Its annihilation of the planet Alderaan, at the merciless command of Grand Moff Tarkin, lives in infamy. And its own ultimate destruction, at the hands of Luke Skywalker, is the stuff of legend. But what is the whole story, and who are the players, behind the creation of this world-killing satellite of doom? The near extermination of the Jedi order cleared the way for Palpatine–power-hungry Senator and Sith Lord–to seize control of the Republic, declare himself Emperor, and usher in a fearsome, totalitarian regime. But even with the dreaded Darth Vader enforcing Palpatine’s sinister will, the threat of rebellion still looms. And the Emperor knows that only abject fear–and the ability to punish dissent with devastating consequences–can ensure his unchallenged control of the galaxy. Enter ambitious and ruthless government official Wilhuff Tarkin, architect of the Emperor’s terrifying dream come true. From inception to completion, construction of the unprecedented Death Star is awash in the intrigues, hidden agendas, unexpected revelations, and daring gambits of those involved on every level. The brightest minds and boldest egos, the most ambitious and corrupt, the desperate and the devious, all have a stake in the Death Star–and its potential to control the fate of the galaxy. Soldiers and slaves, loyalists and Rebels, spies and avengers, the innocent and the evil–all their paths and fates will cross and intertwine as the Death Star moves from its maiden voyage to its final showdown. And a shadowy chapter of Star Wars history is stunningly illuminated in a thrilling, unforgettable adventure. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Han Solo and the Lost Legacy",
    "foundTitle": "Han Solo and the Lost Legacy",
    "description": "The movies are back -- and so is the mania! Be part of the blockbuster Star Wars revival with the new edition of a New York Times-bestselling classic spin-off novel!"
  },
  {
    "youtiniTitle": "Hard Merchandise",
    "foundTitle": "Hard Merchandise"
  },
  {
    "youtiniTitle": "I, Jedi",
    "foundTitle": "I, Jedi",
    "description": "Readers travel deeper than ever before into the mysterious world of the Jedi when Luke Skywalker is forced to stop a secret cadre of pirates who have banded together, posing a threat to the fragile New Republic. Reprint."
  },
  {
    "youtiniTitle": "Maul: Lockdown",
    "foundTitle": "Lockdown: Star Wars Legends (Maul)",
    "description": "NEW YORK TIMES BESTSELLER Set before the events of Star Wars: Episode I The Phantom Menace, this new novel is a thrilling follow-up to Star Wars: Darth Plagueis. It's kill or be killed in the space penitentiary that houses the galaxy’s worst criminals, where convicts face off in gladiatorial combat while an underworld gambling empire reaps the profits of the illicit blood sport. But the newest contender in this savage arena, as demonic to behold as he is deadly to challenge, is fighting for more than just survival. His do-or-die mission, for the dark masters he serves, is to capture the ultimate weapon: an object that will enable the Sith to conquer the galaxy. Sith lords Darth Plagueis and Darth Sidious are determined to possess the prize. And one of the power-hungry duo has his own treacherous plans for it. But first, their fearsome apprentice must take on a bloodthirsty prison warden, a cannibal gang, cutthroat crime lord Jabba the Hutt, and an unspeakable alien horror. No one else could brave such a gauntlet of death and live. But no one else is the dreaded dark-side disciple known as Darth Maul. Praise for Lockdown “Schreiber . . . was a great choice for this novel, imbuing the story with a dark, foreboding tone while never quite stepping into the horror territories that Death Troopers and Red Harvest took us.”—Jedi News “Fans of the dark side should rejoice. Lockdown delivers a can’t-put-this-down tale of scum and villainy.”—Club Jade “[Lockdown is] an action-packed ride that spins one entertaining chapter after another. The multiple layers of story keeps readers guessing what will happen next and just who will live and who will die. . . . It certainly adds to the character of Darth Maul while matching [Darth] Plagueis’s complexity with sheer fun. . . . Five out of five metal bikinis.”—Roqoo Depot “Somehow, Schreiber is able to skate the line between hard-hitting prison story and the adventure and excitement I love from Star Wars in a way that doesn’t betray either genre. It’s really quite masterful.”—Big Shiny Robot “Lockdown is an exciting, engaging read. . . . It actually lines up beautifully for a sequel, which I, for one, would love to read.”—Coffee with Kenobi “The novel makes The Clone Wars better. It also illuminates The Phantom Menace. I think it’s the hallmark of the best tie-in fiction to resonate throughout other parts of the expanded universe in that way.”—Knights’ Archive “By the fiftieth page, I was hooked. . . . Lockdown is a wonderful ‘antihero’ novel, where it’s just fine to root for the villain, because there are even worse things out there. This book was so fun and entertaining. I’ll have to keep an eye out for more Star Wars books from Schreiber.”—Seattle Geekly"
  },
  {
    "youtiniTitle": "Omen",
    "foundTitle": "Omen",
    "description": "This second novel in a Star Wars story arc stars Luke, Han, Leia, and the other heroes of the New Jedi Order and the Legacy of the Force and follows the first installment in the series, Outcast. Reprint. A best-selling book."
  },
  {
    "youtiniTitle": "Republic Commando: True Colors",
    "foundTitle": "True Colors",
    "description": "With the horrors of the Clone Wars continuing to rage on unchecked, the elite warriors of the Republic stumble upon a growing menace that threatens their victory, the Omega Squad's loyalty is tested by a shocking discovery, and the lines begin to blur between friend and foe."
  },
  {
    "youtiniTitle": "Splinter of the Mind's Eye",
    "foundTitle": "Splinter of the Mind's Eye",
    "description": "The further adventures of Luke Skywalker as he fights for right and justice against the evil Imperial forces on the planet Mimbran."
  },
  {
    "youtiniTitle": "Star Wars Episode I: The Phantom Menace (YA)",
    "foundTitle": "Star Wars®: Episode I: The Phantom Menace",
    "description": "Book Details: - Format: E-book - Publication Date: 3/1/2012 - Pages: 192 - Reading Level: Age 8 and Up"
  },
  {
    "youtiniTitle": "Star Wars Episode IV: A New Hope (YA)",
    "foundTitle": "Star Wars®: Episode IV: A New Hope",
    "description": "Luke Skywalker. Han Solo. Princess Leia. The beginning of the Star Wars saga, in an amazing all-new novelization that will tie in with the blockbuster classic Star Wars DVD release. Luke Skywalker. Han Solo. Princess Leia. The beginning of the Star Wars saga, in an amazing all-new novelization that will tie in with the blockbuster classic Star Wars DVD release."
  },
  {
    "youtiniTitle": "The Hutt Gambit",
    "foundTitle": "The Hutt Gambit: Star Wars Legends (The Han Solo Trilogy)",
    "description": "Here is the second novel in the blockbuster new trilogy that reveals the never-before-told story of the young Han Solo. Set before the Star Wars(r) movie adventures, these books chronicle the coming-of-age of the galaxy's most famous con man, smuggler and thief. Solo is now a fugitive from the Imperial Navy. But he has made a valuable friend in a former Wookiee slave named Chewbacca, who has sworn Han a life debt. Han will need all the help he can get. For the Ylesian Hutts have dispatched the dreaded bounty hunter Boba Fett to track down the man who already outsmarted them once. But Han and Chewie find themselves in even bigger trouble when they agree to lend their services to the crime lords Jiliac and Jabba the Hutt. Suddenly the two smugglers are thrust into the middle of a battle between the might of the Empire and the treachery of their outlaw allies...a battle where even victory means death! Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "The Mandalorian Armor",
    "foundTitle": "The Mandalorian Armor: Star Wars Legends (The Bounty Hunter Wars)",
    "description": "He's the most feared and successful bounty hunter in the galaxy. He is Boba Fett, and even the most hardened criminals tremble at his name. Now he faces the deadliest challenge of his infamous career--an all-out war against his most dangerous enemies. As the Rebellion gathers force, Prince Xizor proposes a cunning plan to the Emperor and Darth Vader: smash the power of the Bounty Hunters Guild by turning its members against each other. Only the strongest and most ruthless will survive, and they can be used against the Rebellion. It's a job for the fiercely independent Boba Fett, who jumps at the chance to destroy his rivals. But Fett soon realizes the game is rigged, as he finds himself the target of murderous factions, criminal conspiracies, and the evil at the Empire's dark heart. Boba Fett has always finished first. And in this game, anything less is death. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Vision of the Future",
    "foundTitle": "Vision of the Future: Star Wars Legends (The Hand of Thrawn)",
    "description": "Hugo Award-winning author Timothy Zahn brings his epic two-volume series The Hand of Thrawn to an explosive conclusion with a discovery that rocks the New Republic to its foundations--and threatens to resurrect the Empire. The Empire's master plan is under way. The New Republic is on the verge of civil war and the rumor that the legendary Admiral Thrawn has returned from the dead is rallying the Imperial forces. Now Luke Skywalker, Han Solo, Princess Leia, and their allies face the challenge of their lives. They must infiltrate a hidden fortress filled with Imperial fanatics, rendezvous with a double-dealing Imperial commander, and journey into enemy territory to learn the identity of those responsible for an act of unthinkable genocide. But most important of all is the truth about Thrawn. In his hands--alive or dead--rests the fate of the New Republic. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years! © 1998 Lucasfilm Ltd. & TM All rights reserved. Used under authorization."
  },
  {
    "youtiniTitle": "X-Wing: Iron Fist",
    "foundTitle": "Iron Fist: Star Wars Legends (X-Wing)",
    "description": "They are the Rebel Alliance's ultimate strike force--sleek, swift, and deadly. For these X-wing fighters, no job is too dirty or too dangerous. Now they must rise to meet an impossible challenge: stop a powerful warlord by pretending to be his ally. Against all odds, the controversial Wraith Squadron has survived its first covert mission. But now they are called upon to cheat death twice. This time Wedge Antilles sends them in to stop the warlord Zsinj and his Super Star Destroyer, Iron Fist. If Zsinj joins the Empire, it could turn the tide of war against the Rebels. The Wraith Squadron's mission: infiltrate the warlord's fleet and uncover his carefully guarded plans. To do so, they must pose as ruthless pirates seeking to join Zsinj's forces. And that means first becoming pirates in space lanes teeming with Imperial Navy patrols. If that isn't enough to get them killed, they'll have to pass one last test--a suicide mission for Zsinj. Can they survive the test and turn the tables on Zsinj? Or is this the end for Wraith Squadron? Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "Yoda: Dark Rendezvous",
    "foundTitle": "Yoda: Dark Rendezvous: Star Wars Legends",
    "description": "As the Clone Wars rage, Jedi Master Yoda must once again face one of his greatest adversaries: Count Dooku. . . . The savage Clone Wars have forced the Republic to the edge of collapse. During the height of the battle, one Jedi Knight escapes the carnage to deliver a message to Yoda on Coruscant. It appears that Dooku wants peace and demands a rendezvous. Chances are slim that the treacherous Count is sincere but, with a million lives at stake, Yoda has no choice. The meeting will take place on Djun, a planet steeped in evil. The challenge could not be more difficult. Can Yoda win back his once promising pupil from the dark side or will Count Dooku unleash his sinister forces against his former mentor? Either way, Yoda is sure of one thing: this battle will be one of the fiercest he’ll ever face."
  },
  {
    "youtiniTitle": "Tales from a Galaxy Far, Far Away: Aliens",
    "foundTitle": "Star Wars The Force Awakens: Tales From a Galaxy Far, Far Away",
    "description": "A 368-page book filled with short stories about favorite alien characters in Star Wars: The Force Awakens."
  },
  {
    "youtiniTitle": "The High Republic: The Rising Storm",
    "foundTitle": "Star Wars: the High Republic #2 Novel",
    "description": "The adventures of the Jedi of the High Republic era continue in this Star Wars novel."
  },
  {
    "youtiniTitle": "Assault at Selonia",
    "foundTitle": "Assault at Selonia",
    "description": "Imprisoned on the planet Corellia where he is at the mercy of his evil cousin Thracken, Han Solo teams up with a female alien and launches a desperate escape plan in the hopes of warning Luke and Leia of Thracken's plans to restore the Empire. Original."
  },
  {
    "youtiniTitle": "Jedi Trial",
    "foundTitle": "Star Wars: Jedi Trial",
    "description": "Major original Star Wars adventure set against the backdrop of the Clone Wars and telling the tale of Anakin Skywalker's rise to full Jedi Knight status. Somewhere between Star Wars: Attack of the Clones and Star Wars: Episode III, Anakin Skywalker graduates from Jedi Padawan (apprentice) to Jedi Knight status. This book tells how that happens. A planet that is a crucial communications centre is taken by the Separatists, and the Republic decides to back a guerrilla fighting group called Freedom's Sons in taking it back. A detachment of clone troopers led by Jedi Knight Nejaa Halcyon and Jedi Padawan Anakin Skywalker is sent out to help the Freedom's Sons. Little does Anakin know that the volatile situation on this occupied planet will prove to be his own personal Jedi Trial, and that if he emerges victorious, he will have won the coveted titled of full Jedi Knight, student no longer but Jedi in his own right. This is the Anakin who learns how great his powers can be and how huge is his real potential."
  },
  {
    "youtiniTitle": "Star Wars Episode II: Attack of the Clones",
    "foundTitle": "Star Wars: Episode II - Attack Of The Clones",
    "description": "There is great disturbance in the Force . . . Mischievous and resolved, courageous to the point of recklessness, Anakin Skywalker has come of age in a time of great upheaval. The nineteen-year-old apprentice to Obi-Wan Kenobi is an enigma to the Jedi Council, and a challenge to his Jedi Master. Time has not dulled Anakin’s ambition, nor has his Jedi training tamed his independent streak. When an attempt on Senator Padmé Amidala’s life brings them together for the first time in ten years, it is clear that time also has not dulled Anakin’s intense feelings for the beautiful diplomat. The attack on Senator Amidala just before a crucial vote thrusts the Republic even closer to the edge of disaster. Masters Yoda and Mace Windu sense enormous unease. The dark side is growing, clouding the Jedi’s perception of the events. Unbeknownst to the Jedi, a slow rumble is building into the roar of thousands of soldiers readying for battle. But even as the Republic falters around them, Anakin and Padmé find a connection so intense that all else begins to fall away. Anakin will lose himself—and his way—in emotions a Jedi, sworn to hold allegiance only to the Order, is forbidden to have. Based on the story by George Lucas and the screenplay by George Lucas and Jonathan Hales, this intense and revealing novel by bestselling author R. A. Salvatore sheds new light on the legend of Star Wars—and skillfully illuminates one of our most beloved sagas."
  },
  {
    "youtiniTitle": "Tales from the Empire",
    "foundTitle": "Star Wars Omnibus",
    "description": "Collects Star Wars: Droids Special #1, Star Wars: Droids - The Kalarba Adventures #1-6, Star Wars: Droids - Artoo's Day Out #1, Star Wars: Droids - Rebellion #1-4, Star Wars: Droids - Season of Revolt #1-4, Star Wars: Droids - The Protocol Offensive #1. Before the clueless C-3PO and his clever companion R2-D2 fell into the sands of Tatooine for their first fateful meeting with Luke Skywalker, those two troublesome droids had some amazing adventures all their own! Sold to a junk trader and shipped off to the treacherous Kalarba system, Artoo and Threepio begin a journey that takes them from the jaws of a droid-eating beast to the frontlines of a revolution! Entagled with pirates, bounty hunters, and the notorious space criminal Olag Greck, they do their best to stick together in a dangerous galaxy where anything can happen!"
  },
  {
    "youtiniTitle": "The Approaching Storm",
    "foundTitle": "The Approaching Storm",
    "description": "A thrilling prequel to the upcoming movie Star Wars: Episode II follows Obi-Wan and his Padawan, Anakin, as they embark on a dangerous mission to the planet of Ansion to stop raging border disputes."
  },
  {
    "youtiniTitle": "X-Wing: Mercy Kill",
    "foundTitle": "Star Wars: X-Wing: Mercy Kill"
  },
  {
    "youtiniTitle": "X-Wing: The Bacta War",
    "foundTitle": "The Bacta War",
    "description": "The Rogue Squadron must stop the tyrant Ysanne Isard, who plans to destroy the New Republic using medicinal bacta from the planet Thyferra"
  },
  {
    "youtiniTitle": "The Last Jedi (YA)",
    "foundTitle": "Star Wars The Rise of Skywalker Junior Novel",
    "description": "Something has awakened. Every generation has a legend. Nobody's every really gone. The conclusion of the Skywalker Saga is finally here. This junior novel retelling of Star Wars: The Rise of Skywalker, contains deleted and extended scenes, including exclusive scenes you won't find anywhere else! This book also includes an 8-page full-color insert."
  },
  {
    "youtiniTitle": "Agents of Chaos II: Jedi Eclipse",
    "foundTitle": "Jedi Eclipse",
    "description": "While Princess Leia struggles to evacuate several planets in the wake of an alien onslaught, Luke Skywalker tries to hold the Jedi Knights together. Original."
  },
  {
    "youtiniTitle": "Enemy Lines I: Rebel Dream",
    "foundTitle": "Rebel Dream",
    "description": "As Leia and Han Solo journey from world to world to protest the New Republic Advisory Council's policies of appeasement with regard to the Yuuzhan Vong, Luke Skywalker sneaks into the Yuuzhan Vong's stronghold on Coruscant."
  },
  {
    "youtiniTitle": "Heir to the Empire",
    "foundTitle": "Heir to the Empire: Star Wars Legends",
    "description": "Here is a special 20th anniversary edition of the #1 New York Times bestselling novel that reignited the entire Star Wars publishing phenomenon—featuring an Introduction and annotations from award-winning author Timothy Zahn, exclusive commentary from Lucasfilm and Del Rey Books, and a brand-new novella starring the ever-popular Grand Admiral Thrawn. The biggest event in the history of Star Wars books, Heir to the Empire follows the adventures of Luke Skywalker, Han Solo, and Princess Leia after they led the Rebel Alliance to victory in Star Wars: Episode VI Return of the Jedi. Five years after the Death Star was destroyed and Darth Vader and the Emperor were defeated, the galaxy is struggling to heal the wounds of war, Princess Leia and Han Solo are married and expecting twins, and Luke Skywalker has become the first in a long-awaited line of new Jedi Knights. But thousands of light-years away, the last of the Emperor’s warlords—the brilliant and deadly Grand Admiral Thrawn—has taken command of the shattered Imperial fleet, readied it for war, and pointed it at the fragile heart of the New Republic. For this dark warrior has made two vital discoveries that could destroy everything the courageous men and women of the Rebel Alliance fought so hard to create. The explosive confrontation that results is a towering epic of action, invention, mystery, and spectacle on a galactic scale—in short, a story worthy of the name Star Wars. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "The Clone Wars: Wild Space",
    "foundTitle": "Star Wars",
    "description": "The Jedi Knights lead the battle against a powerful droid army of separatists, while Anakin Skywalker mentors his first Padawan, a girl named Ahsoka, learning the skills of a warrior and becoming a hero of the Clone Wars, in a second novelization based on the new television animated series. Original. 100,000 first printing. (A Cartoon Network series, created by Lucasfilm Animation). (Science Fiction)"
  },
  {
    "youtiniTitle": "The Lando Calrissian Adventures",
    "foundTitle": "Star Wars : The Lando Calrissian Adventures"
  },
  {
    "youtiniTitle": "Before the Storm",
    "foundTitle": "Before the Storm",
    "description": "With the hard-won peace and prestige of the New Republic threatened by a mysterious new enemy and his genocidal intentions, Jedi knight Luke Skywalker journeys to his mother's homeworld in a desperate quest to find her people."
  },
  {
    "youtiniTitle": "Shield of Lies",
    "foundTitle": "Shield of Lies: Star Wars Legends (The Black Fleet Crisis)",
    "description": "As Leia must deal with a new threat to the fragile alliance that binds the New Republic, Lando becomes a prisoner aboard a runaway spacecraft of unknown origin. The ship is following an unstoppable path to its homeworld, destroyed by Imperial forces. Luke continues his quest to learn more about his mother among the Fallanassi, where his every belief about the use of the Force is about to be challenged. And while Leia ponders a diplomatic solution to the aggression of the fierce Yevetha race, Han pilots a spy ship into the heart of Yevethan space and finds himself a hostage on one of the vast fleet of warships under the command of a ruthless leader. Features a bonus section following the novel that includes a primer on the Star Wars expanded universe, and over half a dozen excerpts from some of the most popular Star Wars books of the last thirty years!"
  },
  {
    "youtiniTitle": "The Clone Wars: No Prisoners",
    "foundTitle": "No Prisoners",
    "description": "Torrent Company's Captain Rex agrees to relieve Anakin Skywalker of his ubiquitous and insatiably curious Padawan, Ahsoka, for a while by bringing her along on a routine three-day shakedown cruise aboard Captain Gilad Pellaeon's newly refitted assault shi"
  }
]